[
  {
    "discussion_id": "2104771111",
    "pr_number": 2793,
    "pr_file": "rfc/20250317-ephemeral-resources.md",
    "created_at": "2025-05-23T14:52:42+00:00",
    "commented_code": "+# Ephemeral resources, variables, outputs, locals and write-only arguments\n+\n+Issue: https://github.com/opentofu/opentofu/issues/1996\n+\n+Right now, OpenTofu information for resources and outputs are written to state and plan files as it is. This is presenting a security risk\n+as some information from the stored objects can contain sensitive bits that can become visible to whoever is having access to the state or plan files.\n+\n+To provide a better solution for the aforementioned situation, OpenTofu introduces the concept of \"ephemerality\" which is meant to make use of the already existing functionality in terraform-plugin-framework.\n+Any new feature under this new concept should provide ways to skip values from being written to the state and plan files.\n+\n+This new concept is going to offer another way to tackle the aforementioned issue, adding one more option in OpenTofu to choose for securing the plan and state files.\n+Here are the other existing options, providing different levels of safety:\n+* sensitive marked outputs and variables\n+  * The values marked this way ensures only that the information is sanitized from the user interface, but these are still stored in plaintext in the state and plan files.\n+* state encryption (recommended way)\n+  * This is meant to provide in transit and at rest encryption of the state and plan files, regardless of what providers/modules offer.\n+  * By using this you don't need to choose what to store and what not, but everything is safely stored.\n+  * This is also preventing state tempering and [privilege escalation](https://www.plerion.com/blog/hacking-terraform-state-for-privilege-escalation).\n+\n+## Proposed Solution\n+Two new concepts will be introduced:\n+* `ephemeral` resources\n+* `resource`'s `write-only` attributes\n+\n+Several existing features will have to be able to be updated with the new functionality:\n+* variables\n+* outputs\n+* locals\n+* providers\n+* provisioners\n+* `connection` block\n+\n+> [!NOTE]\n+>\n+> In order to provide a similar and familiar UX for the users, the proposal in this RFC is heavily inspired by the Terraform public documentation and available blog posts on the matter.\n+\n+In the attempt to provide to the reader an in-depth understanding of the ephemerality implications in OpenTofu,\n+this section will try to explain the functional approach of the new concept in each existing feature.\n+\n+### User Documentation\n+#### Write-only attributes\n+This is a new concept that allows any existing `resource` to define attributes in its schema that can be only written without the ability to retrieve the value afterwards.\n+\n+By not being readable, this also means that an attribute configured by a provider this way, should not be written to the state or plan file either.\n+Therefore, these attributes are suitable for configuring specific resources with sensitive data, like passwords, access keys, etc.\n+\n+A write-only attribute can accept an ephemeral or a non-ephemeral value, even though it's recommended to use ephemeral values for such attributes.\n+\n+Because these attributes are not written to the plan file, the update of a write-only attribute it's getting a little bit trickier.\n+Provider implementations do generally include also a \"version\" argument linked to the write-only one.\n+For example having a write-only argument called `secret`, providers should also include\n+a non-write-only argument called `secret_version`. Every time the user wants to update the value of `secret`, it needs to change the value of `secret_version` to trigger a change.\n+The provider implementation is responsible with handling this particular case: because the version attribute is stored also in the state, the provider needs to compare the value from the state with the one from the configuration and in case it differs, it will trigger the update of the `secret` attribute.\n+\n+At the time of writing this RFC, write-only attributes are supported by a low number of providers and resources.\n+Having the `aws_db_instance` as one of those, here is an example on how to use the write-only attributes:\n+```hcl\n+resource \"aws_db_instance\" \"example\" {\n+  // ...\n+  password_wo         = \"your-initial-password\"\n+  password_wo_version = 1\n+  // ...\n+}\n+```\n+By updating **only** the `password_wo`, on the `tofu apply`, the password should not be updated.\n+To do so, the `password_wo_version` needs to be incremented too:\n+```hcl\n+resource \"aws_db_instance\" \"example\" {\n+  // ...\n+  password_wo         = \"new-password\"\n+  password_wo_version = 2\n+  // ...\n+}\n+```\n+\n+As seen in this particular change of the [terraform-plugin-framework](https://github.com/hashicorp/terraform-plugin-framework/commit/ecd80f67daed0b92b243ae59bb1ee2077f8077c7), the write-only attribute cannot be configured for set attributes, set nested attributes and set nested blocks.\n+\n+Write-only attributes cannot generate a plan diff.\n+This is because the prior state does not contain a value that OpenTofu can use to compare the new value against and\n+also the value provider returns during planning of a write-only argument should always be null.\n+This means that there could be inconsistencies between plan and apply for the write-only arguments.\n+\n+#### Variables\n+Any `variable` block can be marked as ephemeral.\n+```hcl\n+variable \"ephemeral_var\" {\n+  type      = string\n+  ephemeral = true\n+}\n+```\n+OpenTofu should allow usage of these variables only in other ephemeral contexts:\n+* write-only arguments\n+* other ephemeral variables\n+* ephemeral outputs\n+* local values\n+* ephemeral resources\n+* provisioner blocks\n+* connection blocks\n+* provider configuration\n+\n+Usage in any other place should raise an error:\n+```hcl\n+│ Error: Invalid use of an ephemeral value\n+│\n+│   with playground_secret.store_secret,\n+│   on main.tf line 30, in resource \"playground_secret\" \"store_secret\":\n+│   30:   secret_name = var.password\n+│\n+│ \"secret_name\" cannot accept an ephemeral value because it is not a write-only attribute which means that will be written to the state.\n+╵\n+```\n+\n+For being able to use ephemeral variables, the module's authors need to mark those as so.\n+If OpenTofu finds an ephemeral value given to a non-ephemeral variable in a module call, an error will be shown:\n+```hcl\n+│ Error: Invalid usage of ephemeral value\n+│\n+│   on main.tf line 21, in module \"secret_management\":\n+│   21:   secret_map     = var.secrets\n+│\n+│ Variable `secret_map` is not marked as ephemeral. Therefore, it cannot reference an ephemeral value. In case this is actually wanted, you can add the following attribute to its declaration:\n+│   ephemeral = true\n+```\n+\n+\n+OpenTofu should not store ephemeral variable(s) in plan files.\n+If a plan is generated from a configuration that is having at least one ephemeral variable,\n+when the planfile will be applied, the value(s) for the ephemeral variable(s) needs to be provided again.\n+\n+#### Outputs\n+Most `output` blocks can be configured as ephemeral.\n+\n+To mark an output as ephemeral, use the following syntax:\n+```hcl\n+output \"test\" {\n+  // ...\n+  ephemeral = true\n+}\n+```\n+\n+The ephemeral outputs are available during plan and apply phase and can be accessed only in specific contexts:\n+* ephemeral variables\n+* other ephemeral outputs\n+* write-only attributes\n+* ephemeral resources\n+* `provisioner` block\n+* `connection` block\n+\n+An `output` block from a root module cannot be marked as ephemeral.\n+This limitation is natural since ephemeral outputs are meant to be skipped from the state file.\n+Therefore, there is no usage of such a defined output block in a root module.\n+When encountering an ephemeral output in a root module, an error similar to this one should be shown:\n+```hcl\n+│ Error: Unallowed ephemeral output\n+│\n+│   on main.tf line 36:\n+│   36: output \"write_only_out\" {\n+│\n+│ Root module is not allowed to have ephemeral outputs\n+```\n+\n+Ephemeral outputs are useful when a child module returns sensitive data,\n+allowing the caller to use the value of that output in other ephemeral contexts.\n+When using outputs in non-ephemeral contexts, OpenTofu should show an error similar to the following:\n+```hcl\n+│ Error: Invalid use of an ephemeral value\n+│\n+│   with aws_secretsmanager_secret_version.store_from_ephemeral_output,\n+│   on main.tf line 31, in resource \"aws_secretsmanager_secret_version\" \"store_from_ephemeral_output\":\n+│   31:   secret_string = module.secret_management.secrets\n+│\n+│ \"secret_string\" cannot accept an ephemeral value because it is not a write-only attribute which means that will be written to the state.\n+╵\n+```\n+\n+Any output that wants to use an ephemeral value, it needs to be marked as ephemeral too.\n+Otherwise, it needs to show an error:\n+```hcl\n+│ Error: Output not marked as ephemeral\n+│\n+│   on mod/main.tf line 33, in output \"password\":\n+│   33:   value = reference.to.ephemeral.value\n+│\n+│ In order to allow this output to store ephemeral values add `ephemeral = true` attribute to it.\n+```\n+> [!NOTE]\n+>\n+> It's needed to say that the last error will be raised only when a non-ephemeral output is referencing an ephemeral value.\n+> But it needs to be allowed for an ephemeral marked output to reference a non-ephemeral value.\n+\n+#### Locals\n+Local values are automatically marked as ephemeral if any of the value that is used to compute the local is already an ephemeral one.\n+\n+Eg:\n+```hcl\n+variable \"a\" {\n+  type = string\n+  default = \"a value\"\n+}\n+\n+variable \"b\" {\n+  type = string\n+  default = \"b value\"\n+  ephemeral = true\n+}\n+\n+locals {\n+  a_and_b = \"${var.a}_${var.b}\"\n+}\n+```\n+Because variable `b` is marked as `ephemeral`, then the local `a_and_b` is marked as `ephemeral` too.\n+\n+Locals marked as ephemeral are available during plan and apply phase and can be referenced only in specific contexts:\n+* ephemeral variables\n+* other ephemeral locals\n+* write-only attributes\n+* ephemeral resources\n+* `provider` blocks configuration\n+* `connection` and `provisioner` blocks\n+\n+#### Ephemeral resource\n+In contrast with the write-only arguments where only specifically tagged attributes are not stored in the state/plan file, `ephemeral` resources are not stored entirely.\n+The ephemeral blocks are behaving similar to `data`, where it reads the indicated resource and once it's done with it, is going to close it.\n+\n+Ephemeral resources can be referenced only in specific contexts:\n+* other ephemeral resources\n+* ephemeral variables\n+* ephemeral outputs\n+* locals\n+* to configure `provider` blocks\n+* in `provisioner` and `connection` blocks\n+* in write-only arguments\n+\n+For example, you can have an ephemeral resource that is retrieving the password from a secret manager, password that can be passed later into a write-only attribute of another normal `resource`.\n+To do so, the flow of an ephemeral resource should look similar to the following:\n+* Requests the information from the provider.\n+* Is passing it into the evaluation context that will be used to evaluate expressions that are referencing it.\n+  * Is not storing the value in plan or state file.\n+* When accessing the value, OpenTofu will have to check for the presence of the `RenewAt`:\n+  * If the timestamp is having a value and the current timestamp is at or over the timestamp indicated by `RenewAt`, call the provider `Renew` method.\n+* When a reference is found to an ephemeral resource, OpenTofu should double check that the attribute referencing it is allowed to do so.\n+  * See the contexts above where an ephemeral resource can be referenced.\n+* At the end, the ephemeral resource needs to be closed. OpenTofu should call `Close` on the provider for all opened ephemeral resources.\n+\n+Beside the attributes in a schema of an ephemeral resource, the block should support also the meta-arguments existing in OpenTofu:\n+* `depends_on`\n+* `count`\n+* `for_each`\n+* `provider`\n+* `lifecycle`\n+\n+The only `lifecycle` content that ephemerals should support are `precondition` and `postcondition`. In case OpenTofu will find other known attributes of the `lifecycle` block, it should show an error similar to the following:\n+```\n+│ Error: Invalid lifecycle configuration for ephemeral resource\n+│                                                           \n+│   on ../mod/main.tf line 44, in ephemeral \"aws_secretsmanager_secret_version\" \"secret_retrieval\":                     \n+│   44:     create_before_destroy = true                    \n+│                                                           \n+│ The lifecycle argument \"create_before_destroy\" cannot be used in ephemeral resources. This is meant \n+│ to be used strictly in \"resource\" blocks.\n+```\n+\n+The meta-arguments `provisioner` and `connection` should not be supported.\n+#### Providers\n+`provider` block is ephemeral by nature, meaning that the configuration of this is never stored into state/plan file.\n+\n+Therefore, this block should be configurable by using ephemeral values.\n+\n+#### `provisioner` block\n+As `provisioner` information is not stored into the plan/state file, this can reference ephemeral values like ephemeral variables, outputs, locals and values from ephemeral resources.\n+\n+Whenever doing so, the output of the provisioner execution should be suppressed:\n+```\n+(local-exec): (output suppressed due to ephemeral value in config)\n+```\n+#### `connection` block\n+When the `connection` block is configured, this should be allowed to use ephemeral values from variables, outputs, locals and values from ephemeral resources.\n+\n+### Example on how the new changes will work together\n+To better understand how all of this should work in OpenTofu, let's take a look at a comprehensive example.\n+#### Configuration\n+<details>\n+<summary>./mod/main.tf</summary>\n+\n+```hcl\n+terraform {\n+  required_providers {\n+    aws = {\n+      source  = \"hashicorp/aws\"\n+      version = \"6.0.0-beta1\"\n+    }\n+  }\n+}\n+\n+variable \"secret_map\" {\n+  type = map(string)\n+  default = {}\n+  ephemeral = true # (1)\n+}\n+\n+variable \"secret_version\" { # (2)\n+  type    = number\n+  default = 1\n+}\n+\n+variable \"secret_manager_arn\" {\n+  type    = string\n+  default = \"\"\n+}\n+\n+resource \"aws_secretsmanager_secret\" \"manager\" {\n+  count = var.secret_version > 1 ? 1 : 0\n+  name  = \"ephemeral-rfc-example\"\n+}\n+\n+resource \"aws_secretsmanager_secret_version\" \"secret_creation\" {\n+  count                    = var.secret_version > 1 ? 1 : 0\n+  secret_id                = aws_secretsmanager_secret.manager[0].arn\n+  secret_string_wo = jsonencode(var.secret_map) # (3)\n+  secret_string_wo_version = var.secret_version\n+}\n+\n+ephemeral \"aws_secretsmanager_secret_version\" \"secret_retrieval\" { # (4)\n+  count     = var.secret_version > 1 ? 1 : 0\n+  secret_id = aws_secretsmanager_secret.manager[0].arn\n+  depends_on = [\n+    aws_secretsmanager_secret_version.secret_creation\n+  ]\n+}\n+\n+ephemeral \"aws_secretsmanager_secret_version\" \"secret_retrieval_direct\" {\n+  count     = var.secret_version > 1 ? 0 : 1\n+  secret_id = var.secret_manager_arn\n+}\n+\n+output \"secrets\" {\n+  value = \"${var.secret_version > 1 ?\n+    jsondecode(ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0].secret_string) :\n+    jsondecode(ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0].secret_string)}\"\n+  ephemeral = true # (5)\n+}\n+\n+output \"secret_manager_arn\" {\n+  value = var.secret_version > 1 ? aws_secretsmanager_secret.manager[0].arn : null\n+}\n+```\n+This module can be used for two separate operations:\n+1. When `secret_version` is having a value greater than 1, it will add the given `secret` into a secret manager.\n+2. When `secret_version` is not given, it will use the `secret_manager_arn` to read the secret by using an ephemeral resource.\n+\n+Details:\n+- (1) Variables should be able to be marked as ephemeral. By doing so, those should be able to be used only in ephemeral contexts.\n+- (2) Version field that is going together with the actual write-only argument to be able to update the value of it. To upgrade the secret, the version field needs to be updated, otherwise OpenTofu should generate no diff for it.\n+- (3) `aws_secretsmanager_secret_version.secret_creation.secret_string_wo` is the write-only attribute that is receiving the `secret` variable which is ephemeral (even though a write-only argument can use also a non-ephemeral value).\n+- (4) Using ephemeral resource to retrieve the secret. Maybe looks a little bit weird, because right above we are having the resource of the same type that is looking like it should be able to be used to get the secret. In reality, because that `resource` is using the write-only attribute `secret_string_wo` to store the information, that field is going to be null when referenced.\n+- (5) Module output that is referencing an ephemeral value, it needs to be marked as ephemeral too. Otherwise, OpenTofu should generate an error.\n+  - This is similar to the behavior that is already present for `sensitive` values.\n+</details>\n+\n+<details>\n+<summary>./store/main.tf</summary>\n+\n+```hcl\n+terraform {\n+  required_providers {\n+    aws = {\n+      source  = \"hashicorp/aws\"\n+      version = \"6.0.0-beta1\"\n+    }\n+  }\n+}\n+provider \"aws\" {\n+  alias = \"secrets-read-write\"\n+}\n+\n+variable \"access_key\" {\n+  type      = string\n+  ephemeral = false # (1)\n+}\n+\n+variable \"secret_key\" {\n+  type      = string\n+  ephemeral = false\n+}\n+\n+locals {\n+  secrets = {\n+    \"access_key\" : var.access_key,\n+    \"secret_key\" : var.secret_key\n+  }\n+}\n+\n+module \"secret_management\" {\n+  providers = {\n+    aws : aws.secrets-read-write\n+  }\n+  source         = \"../mod\"\n+  secret_map     = local.secrets\n+  secret_version = 2\n+}\n+\n+output \"secret_manager_arn\" {\n+  value = module.secret_management.secret_manager_arn\n+}\n+```\n+This file is a configuration used to manage the secrets from the secret manager and just \n+outputs the ARN of the secret manager to be used later.\n+\n+Details:\n+- (1) The variable that is going to be used in an ephemeral variable, is not required to be ephemeral. The value can also be a hardcoded value without being ephemeral.\n+</details>\n+\n+<details>\n+<summary>./read/main.tf</summary>\n+\n+```hcl\n+terraform {\n+  required_providers {\n+    aws = {\n+      source  = \"hashicorp/aws\"\n+      version = \"6.0.0-beta1\"\n+    }\n+  }\n+}\n+provider \"aws\" {\n+  alias = \"read-secrets\"\n+}\n+\n+variable \"secret_manager_arn\" {\n+  type = string\n+}\n+\n+module \"secret_management\" { # (1)\n+  providers = {\n+    aws : aws.read-secrets\n+  }\n+  source             = \"../mod\"\n+  secret_manager_arn = var.secret_manager_arn\n+}\n+\n+provider \"aws\" {\n+  alias      = \"dev-access\"\n+  access_key = module.secret_management.secrets[\"access_key\"] # (2)\n+  secret_key = module.secret_management.secrets[\"secret_key\"]\n+}\n+\n+resource \"aws_ssm_parameter\" \"store_ephemeral_in_write_only\" { # (3)\n+  provider         = aws.dev-access\n+  name             = \"parameter_from_ephemeral_value\"\n+  type             = \"SecureString\"\n+  value_wo = jsonencode(module.secret_management.secrets) # (4)\n+  value_wo_version = 1\n+\n+  provisioner \"local-exec\" {\n+    when    = create\n+    command = \"echo non-ephemeral value: ${aws_ssm_parameter.store_ephemeral_in_write_only.arn}\"\n+  }\n+\n+  # provisioner \"local-exec\" { # (5)\n+  #   when    = create\n+  #   command = \"echo write-only value: ${aws_ssm_parameter.store_ephemeral_in_write_only.value_wo}\"\n+  # }\n+\n+  provisioner \"local-exec\" {\n+    when    = create\n+    command = \"echo ephemeral value from module: #${jsonencode(module.secret_management.secrets)}#\" # (6)\n+  }\n+}\n+```\n+This configuration is using the same module to retrieve the secret by using an ephemeral resource and \n+is using it to create a new resource, passing the ephemeral value into a write-only attribute.\n+\n+Details:\n+- (1) Calling the module that we defined previously just to retrieve the secret by using an ephemeral value.\n+- (2) Use the secret from the module to configure the `aws.dev-access` provider.\n+- (3) Here we used `aws_ssm_parameter` which can be configured with write-only arguments.\n+- (4) Referencing a module ephemeral output to ensure that the ephemeral information is passed correctly between two modules.\n+- (5) This `provisioner` block is commented out because interpolation of null values is not allowed in OpenTofu. Reminder: a write-only argument will always be returned as null from the provider even when the configuration is actually having a value.\n+- (6) A provisioner that is referencing an ephemeral value (module output) should have its output suppressed. Details in [Write-only arguments under Technical Approach](#write-only-arguments)\n+</details>\n+\n+#### CLI Output\n+\n+<details>\n+<summary>Applying `store` configuration</summary>\n+\n+```\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Configuration unknown, deferring...\n+# ^^^ (1)\n+ \n+OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with\n+the following symbols:\n+  + create\n+\n+OpenTofu will perform the following actions:\n+\n+  # module.secret_management.aws_secretsmanager_secret.manager[0] will be created\n+  + resource \"aws_secretsmanager_secret\" \"manager\" {\n+      + name                           = \"ephemeral-rfc-example\"\n+      # ...\n+    }\n+\n+  # module.secret_management.aws_secretsmanager_secret_version.secret_creation[0] will be created\n+  + resource \"aws_secretsmanager_secret_version\" \"secret_creation\" {\n+      + secret_string_wo         = (write-only attribute)\n+      + secret_string_wo_version = 2\n+      # ...\n+    }\n+# ^^^ (2)\n+Plan: 2 to add, 0 to change, 0 to destroy.\n+\n+Changes to Outputs:\n+  + secret_manager_arn = (known after apply)\n+\n+Do you want to perform these actions?\n+  OpenTofu will perform the actions described above.\n+  Only 'yes' will be accepted to approve.\n+\n+  Enter a value: yes\n+\n+module.secret_management.aws_secretsmanager_secret.manager[0]: Creating...\n+module.secret_management.aws_secretsmanager_secret.manager[0]: Creation complete after 0s [id=arn:aws:secretsmanager:AWS_REGION:ACC_ID:secret:ephemeral-rfc-example-WGZP9D]\n+module.secret_management.aws_secretsmanager_secret_version.secret_creation[0]: Creating...\n+module.secret_management.aws_secretsmanager_secret_version.secret_creation[0]: Creation complete after 0s [id=arn:aws:secretsmanager:AWS_REGION:ACC_ID:secret:ephemeral-rfc-example-WGZP9D]\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Opening... # <--- (3)\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Opening complete after 0s\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Closing... # <--- (4)\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Closing complete after 0s\n+\n+Apply complete! Resources: 2 added, 0 changed, 0 destroyed.\n+\n+```\n+\n+This is an output that would be visible when running `tofu apply` by using `store/main.tf`.\n+\n+Details:\n+- (1) If an ephemeral block is referencing any unknown value, the opening is deferred for later, when the value will be known.\n+- (2) As can be seen, the ephemeral resources are not shown in the list of changes. The only mention of those is in the actual action logs where we can see that it opens and closing those.\n+- (3) This should be visible in the action logs, while an ephemeral resource will be opened.\n+- (4) This should be visible in the action logs, while an ephemeral resource will be closed.\n+</details>\n+\n+<details>\n+<summary>Applying `read` configuration</summary>\n+\n+```\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Opening...\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Opening complete after 0s\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Closing...\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Closing complete after 0s\n+# ^^^ (1)\n+OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the\n+following symbols:\n+  + create\n+\n+OpenTofu will perform the following actions:\n+\n+  # aws_ssm_parameter.store_ephemeral_in_write_only will be created\n+  + resource \"aws_ssm_parameter\" \"store_ephemeral_in_write_only\" {\n+      + name             = \"parameter_from_ephemeral_value\"\n+      + type             = \"SecureString\"\n+      + value            = (sensitive value)\n+      + value_wo         = (write-only attribute) # <--- (2)\n+      + value_wo_version = 1\n+      # ...\n+    }\n+\n+Plan: 1 to add, 0 to change, 0 to destroy.\n+\n+Do you want to perform these actions?\n+  OpenTofu will perform the actions described above.\n+  Only 'yes' will be accepted to approve.\n+\n+  Enter a value: yes\n+\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Opening...\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Opening complete after 0s\n+aws_ssm_parameter.store_ephemeral_in_write_only: Creating...\n+aws_ssm_parameter.store_ephemeral_in_write_only: Provisioning with 'local-exec'...\n+aws_ssm_parameter.store_ephemeral_in_write_only (local-exec): Executing: [\"/bin/sh\" \"-c\" \"echo non-ephemeral value: arn:aws:ssm:AWS_REGION:ACC_ID:parameter/parameter_from_ephemeral_value\"]\n+aws_ssm_parameter.store_ephemeral_in_write_only (local-exec): non-ephemeral value: arn:aws:ssm:AWS_REGION:ACC_ID:parameter/parameter_from_ephemeral_value\n+aws_ssm_parameter.store_ephemeral_in_write_only: Provisioning with 'local-exec'...\n+aws_ssm_parameter.store_ephemeral_in_write_only (local-exec): (output suppressed due to ephemeral value in config) # <--- (3)\n+aws_ssm_parameter.store_ephemeral_in_write_only (local-exec): (output suppressed due to ephemeral value in config)\n+aws_ssm_parameter.store_ephemeral_in_write_only: Creation complete after 0s [id=parameter_from_ephemeral_value]\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Closing...\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Closing complete after 0s\n+```\n+\n+This is an output that would be visible when running `tofu apply` by using `read/main.tf`.\n+\n+Details:\n+- (1) Because the only resource that this configuration is going to create is referencing an ephemeral resource from the module, the ephemeral resource is accessed during plan phase too.\n+- (2) Write-only arguments are not going to be shown in the UI either.\n+- (3) This is how a provisioner output should look like when an ephemeral value is used in the expression.\n+\n+</details>\n+\n+## Technical Approach\n+> [!NOTE]\n+>\n+> Any rule ending in `If any found, an error will be raised.` is having an error defined in the [User Documentation](#user-documentation) section.\n+\n+In this section, as in the \"Proposed Solution\" section, we'll go over each concept, but this time with a more technical focus.\n+\n+### Write-only arguments\n+Most of the write-only arguments logic is already in the [provider-framework](https://github.com/hashicorp/terraform-plugin-framework):\n+* [Initial implementation](https://github.com/hashicorp/terraform-plugin-framework/pull/1044)\n+* [Sets comparison enhancement](https://github.com/hashicorp/terraform-plugin-framework/pull/1064)\n+  * This seems to be related to the reason why sets of any kind are not allowed to be marked as write-only\n+* [Dynamic attribute validation](https://github.com/hashicorp/terraform-plugin-framework/pull/1090)\n+* [Prevent write-only for sets](https://github.com/hashicorp/terraform-plugin-framework/pull/1095)\n+* [Nullifying write-only attributes moved to an earlier stage](https://github.com/hashicorp/terraform-plugin-framework/pull/1097)\n+\n+On the OpenTofu side the following needs to be tackled:\n+* Update [Attribute](https://github.com/opentofu/opentofu/blob/ff4c84055065fa2d83d318155b72aef6434d99e4/internal/configs/configschema/schema.go#L44) to add a field for the WriteOnly flag.\n+* Update the validation of the provider generated plan in such a way to allow nil values for the fields that are actually having a value defined in the configuration. This is necessary because the plugin framework is setting nil any values that are marked as write-only.\n+  * Test this in-depth for all the block types except sets of any kind (Investigate and understand why sets are not allowed by the plugin framework).\n+    * Add a new validation on the provider schema to check against, set nested attributes and set nested blocks with writeOnly=true. Tested this with a version of terraform-plugin-framework that allowed writeOnly on sets and there is an error returned. (set attributes are allowed based on my tests)\n+      In order to understand this better, maybe we should allow this for the moment and test OpenTofu with the [plugin-framework version](https://github.com/hashicorp/terraform-plugin-framework/commit/0724df105602e6b6676e201b7c0c5e1d187df990) that allows sets to be write-only=true.\n+\n+> [!NOTE]\n+>\n+> Write-only attributes should be presented in the OpenTofu's UI as `(write-only attribute)` instead of the actual value.\n+\n+### Variables\n+\n+For enabling ephemeral variables, these are the basic steps that need to be taken:\n+* Update config to support the `ephemeral` attribute.\n+* Mark the variables with a new mark and ensure that the marks are propagated correctly.\n+  * Recently, [2503](https://github.com/opentofu/opentofu/pull/2503) has been merged. This changed the way OpenTofu is handling marks. Before 2503, there was only one mark (sensitive), so there were places that treated a marked value as a sensitive one, but when a new mark (deprecated) has been introduced, we had to fix the way OpenTofu considers sensitive values.\n+* Based on the marks, ensure that the variable cannot be used in other contexts than the ephemeral ones (see the [User Documentation](#user-documentation) section for more details on where this is allowed). If any found, an error will be raised.\n+* Check the state of [#1998](https://github.com/opentofu/opentofu/pull/1998). If that is merged, in the changes where variables from plan are verified against the configuration ones, we also need to add a validation on the ephemerality of variables. If the variable is marked as ephemeral, then the plan value is allowed (expected) to be missing.\n+* Ensure that when the prompt is shown for an ephemeral variable, there is indication of that:\n+  ```hcl\n+  var.password (ephemeral)\n+     Enter a value:\n+  ```\n+* If a module is having an ephemeral variable declared, that variable can get values from any source, even another non-ephemeral variable.\n+* A variable not marked as ephemeral should not be able to reference an ephemeral value. A non-ephemeral variable will not become ephemeral when referencing an ephemeral value. If any found, an error will be raised.\n+\n+We should use boolean marks, as no additional information is required to be carried. When introducing the marks for these, extra care should be taken in *all* the places marks are handled and ensure that the existing implementation around marks is not affected.\n+\n+> [!NOTE]\n+>\n+> When adding the mark for ephemeral, ensure that there are unit tests to confirm that multiple mark types can work together:\n+> * When an ephemeral marked value is marked also with deprecated/sensitive, all marks are present on the value.\n+> * When an ephemeral marked value is unmarked for some operations, the other marks are still carried over.\n+\n+### Outputs\n+\n+For enabling ephemeral outputs, these are the basic steps that need to be taken:\n+* Update config to support the `ephemeral` attribute.\n+* Mark the outputs with a new mark and ensure that the marks are propagated correctly.\n+  * We should use boolean marks, as no additional information is required to be carried. When introducing the marks for these, extra care should be taken in *all* the places marks are handled and ensure that the existing implementation around marks is not affected.\n+* Based on the marks, ensure that the output cannot be used in other contexts than the ephemeral ones (see the [User Documentation](#user-documentation) section for more details on where this is allowed). If any found, an error will be raised.\n+\n+> [!INFO]\n+>\n+> For an example on how to properly introduce a new mark in the outputs, you can check the [PR](https://github.com/opentofu/opentofu/pull/2633) for the deprecated outputs.\n+\n+Strict rules:\n+* A root module cannot define ephemeral outputs. If any found, an error will be raised.\n+* Any output that wants to use an ephemeral value, it needs to be marked as ephemeral too. If any found, an error will be raised.\n+* Any output referencing an ephemeral value needs to be marked as ephemeral too. If any found, an error will be raised.\n+* Any output from a root module that is referencing a write-only attribute needs to be marked as sensitive. If any found, an error will be raised.\n+* Any output marked as ephemeral should be able to reference a non-ephemeral value.\n+\n+Considering the rules above, root modules cannot have any ephemeral outputs defined.\n+\n+### Locals\n+Any `local` declaration should be marked as ephemeral if in the expression that initialises it an ephemeral value is used:\n+```hcl\n+variable \"var1\" {\n+  type = string\n+}\n+\n+variable \"var2\" {\n+  type = string\n+}\n+\n+variable \"var3\" {\n+  type      = string\n+  ephemeral = true\n+}\n+\n+locals {\n+  eg1 = var.var1 == \"\" ? var.var2 : var.var1 // not ephemeral\n+  eg2 = var.var2 // not ephemeral\n+  eg3 = var.var3 == \"\" ? var.var2 : var.var1 // ephemeral because of var3 conditional\n+  eg4 = var.var1 == \"\" ? var.var2 : var.var3 // ephemeral because of var3 usage\n+  eg5 = \"${var.var3}-${var.var1}\" // ephemeral because of var3 usage\n+  eg6 = local.eg4 // ephemeral because of eg4 is ephemeral\n+}\n+```\n+\n+Once a local is marked as ephemeral, this can be used only in other ephemeral contexts. Check the `Proposed Solution` section for more details on the allowed contexts.\n+\n+### Ephemeral resources\n+Due to the fact ephemeral resources are not stored in the state/plan file, this block is not creating a diff in the OpenTofu's UI.\n+Instead, OpenTofu should notify the user of opening/renewing/closing an ephemeral resource with messages similar to the following:\n+```bash\n+ephemeral.playground_random.password: Opening...\n+ephemeral.playground_random.password: Opening succeeded after 0s\n+ephemeral.playground_random.password: Closing...\n+ephemeral.playground_random.password: Closing succeeded after 0s\n+```\n+\n+Methods that an ephemeral resource should/could have:\n+* Required:\n+  * Open - should be called on the provider to read the information of the indicated resource.\n+  * Metadata - returns the type name of the ephemeral resource.\n+  * Schema - should be called on the provider to get the schema defined for the ephemeral resource.\n+* Optional:\n+  * Renew - if the response from `Open` contains a valid `RenewAt`, OpenTofu should call this method in order to instruct the provider to renew any possible remote information related to the secret returned from the `Open` call.\n+  * Close - should be called on the provider to clean any possible remote information related to the secret returned in the response from `Open`.\n+  * ValidateConfig - validates the configuration provided for the ephemeral resource.\n+\n+Ephemeral resources lifecycle is similar with the data blocks:\n+* Both basic implementations require the same methods (`Metadata` and `Schema`) while datasource is defining `Read` compared with the ephemeral resource that is defining `Open`. When talking about the basic functionality of the ephemeral resources, the `Open` method should behave similarly with the `Read` on a datasource, where it asks the provider for the data associated with that particular ephemeral resource.",
    "repo_full_name": "opentofu/opentofu",
    "discussion_comments": [
      {
        "comment_id": "2104771111",
        "repo_full_name": "opentofu/opentofu",
        "pr_number": 2793,
        "pr_file": "rfc/20250317-ephemeral-resources.md",
        "discussion_id": "2104771111",
        "commented_code": "@@ -0,0 +1,859 @@\n+# Ephemeral resources, variables, outputs, locals and write-only arguments\n+\n+Issue: https://github.com/opentofu/opentofu/issues/1996\n+\n+Right now, OpenTofu information for resources and outputs are written to state and plan files as it is. This is presenting a security risk\n+as some information from the stored objects can contain sensitive bits that can become visible to whoever is having access to the state or plan files.\n+\n+To provide a better solution for the aforementioned situation, OpenTofu introduces the concept of \"ephemerality\" which is meant to make use of the already existing functionality in terraform-plugin-framework.\n+Any new feature under this new concept should provide ways to skip values from being written to the state and plan files.\n+\n+This new concept is going to offer another way to tackle the aforementioned issue, adding one more option in OpenTofu to choose for securing the plan and state files.\n+Here are the other existing options, providing different levels of safety:\n+* sensitive marked outputs and variables\n+  * The values marked this way ensures only that the information is sanitized from the user interface, but these are still stored in plaintext in the state and plan files.\n+* state encryption (recommended way)\n+  * This is meant to provide in transit and at rest encryption of the state and plan files, regardless of what providers/modules offer.\n+  * By using this you don't need to choose what to store and what not, but everything is safely stored.\n+  * This is also preventing state tempering and [privilege escalation](https://www.plerion.com/blog/hacking-terraform-state-for-privilege-escalation).\n+\n+## Proposed Solution\n+Two new concepts will be introduced:\n+* `ephemeral` resources\n+* `resource`'s `write-only` attributes\n+\n+Several existing features will have to be able to be updated with the new functionality:\n+* variables\n+* outputs\n+* locals\n+* providers\n+* provisioners\n+* `connection` block\n+\n+> [!NOTE]\n+>\n+> In order to provide a similar and familiar UX for the users, the proposal in this RFC is heavily inspired by the Terraform public documentation and available blog posts on the matter.\n+\n+In the attempt to provide to the reader an in-depth understanding of the ephemerality implications in OpenTofu,\n+this section will try to explain the functional approach of the new concept in each existing feature.\n+\n+### User Documentation\n+#### Write-only attributes\n+This is a new concept that allows any existing `resource` to define attributes in its schema that can be only written without the ability to retrieve the value afterwards.\n+\n+By not being readable, this also means that an attribute configured by a provider this way, should not be written to the state or plan file either.\n+Therefore, these attributes are suitable for configuring specific resources with sensitive data, like passwords, access keys, etc.\n+\n+A write-only attribute can accept an ephemeral or a non-ephemeral value, even though it's recommended to use ephemeral values for such attributes.\n+\n+Because these attributes are not written to the plan file, the update of a write-only attribute it's getting a little bit trickier.\n+Provider implementations do generally include also a \"version\" argument linked to the write-only one.\n+For example having a write-only argument called `secret`, providers should also include\n+a non-write-only argument called `secret_version`. Every time the user wants to update the value of `secret`, it needs to change the value of `secret_version` to trigger a change.\n+The provider implementation is responsible with handling this particular case: because the version attribute is stored also in the state, the provider needs to compare the value from the state with the one from the configuration and in case it differs, it will trigger the update of the `secret` attribute.\n+\n+At the time of writing this RFC, write-only attributes are supported by a low number of providers and resources.\n+Having the `aws_db_instance` as one of those, here is an example on how to use the write-only attributes:\n+```hcl\n+resource \"aws_db_instance\" \"example\" {\n+  // ...\n+  password_wo         = \"your-initial-password\"\n+  password_wo_version = 1\n+  // ...\n+}\n+```\n+By updating **only** the `password_wo`, on the `tofu apply`, the password should not be updated.\n+To do so, the `password_wo_version` needs to be incremented too:\n+```hcl\n+resource \"aws_db_instance\" \"example\" {\n+  // ...\n+  password_wo         = \"new-password\"\n+  password_wo_version = 2\n+  // ...\n+}\n+```\n+\n+As seen in this particular change of the [terraform-plugin-framework](https://github.com/hashicorp/terraform-plugin-framework/commit/ecd80f67daed0b92b243ae59bb1ee2077f8077c7), the write-only attribute cannot be configured for set attributes, set nested attributes and set nested blocks.\n+\n+Write-only attributes cannot generate a plan diff.\n+This is because the prior state does not contain a value that OpenTofu can use to compare the new value against and\n+also the value provider returns during planning of a write-only argument should always be null.\n+This means that there could be inconsistencies between plan and apply for the write-only arguments.\n+\n+#### Variables\n+Any `variable` block can be marked as ephemeral.\n+```hcl\n+variable \"ephemeral_var\" {\n+  type      = string\n+  ephemeral = true\n+}\n+```\n+OpenTofu should allow usage of these variables only in other ephemeral contexts:\n+* write-only arguments\n+* other ephemeral variables\n+* ephemeral outputs\n+* local values\n+* ephemeral resources\n+* provisioner blocks\n+* connection blocks\n+* provider configuration\n+\n+Usage in any other place should raise an error:\n+```hcl\n+│ Error: Invalid use of an ephemeral value\n+│\n+│   with playground_secret.store_secret,\n+│   on main.tf line 30, in resource \"playground_secret\" \"store_secret\":\n+│   30:   secret_name = var.password\n+│\n+│ \"secret_name\" cannot accept an ephemeral value because it is not a write-only attribute which means that will be written to the state.\n+╵\n+```\n+\n+For being able to use ephemeral variables, the module's authors need to mark those as so.\n+If OpenTofu finds an ephemeral value given to a non-ephemeral variable in a module call, an error will be shown:\n+```hcl\n+│ Error: Invalid usage of ephemeral value\n+│\n+│   on main.tf line 21, in module \"secret_management\":\n+│   21:   secret_map     = var.secrets\n+│\n+│ Variable `secret_map` is not marked as ephemeral. Therefore, it cannot reference an ephemeral value. In case this is actually wanted, you can add the following attribute to its declaration:\n+│   ephemeral = true\n+```\n+\n+\n+OpenTofu should not store ephemeral variable(s) in plan files.\n+If a plan is generated from a configuration that is having at least one ephemeral variable,\n+when the planfile will be applied, the value(s) for the ephemeral variable(s) needs to be provided again.\n+\n+#### Outputs\n+Most `output` blocks can be configured as ephemeral.\n+\n+To mark an output as ephemeral, use the following syntax:\n+```hcl\n+output \"test\" {\n+  // ...\n+  ephemeral = true\n+}\n+```\n+\n+The ephemeral outputs are available during plan and apply phase and can be accessed only in specific contexts:\n+* ephemeral variables\n+* other ephemeral outputs\n+* write-only attributes\n+* ephemeral resources\n+* `provisioner` block\n+* `connection` block\n+\n+An `output` block from a root module cannot be marked as ephemeral.\n+This limitation is natural since ephemeral outputs are meant to be skipped from the state file.\n+Therefore, there is no usage of such a defined output block in a root module.\n+When encountering an ephemeral output in a root module, an error similar to this one should be shown:\n+```hcl\n+│ Error: Unallowed ephemeral output\n+│\n+│   on main.tf line 36:\n+│   36: output \"write_only_out\" {\n+│\n+│ Root module is not allowed to have ephemeral outputs\n+```\n+\n+Ephemeral outputs are useful when a child module returns sensitive data,\n+allowing the caller to use the value of that output in other ephemeral contexts.\n+When using outputs in non-ephemeral contexts, OpenTofu should show an error similar to the following:\n+```hcl\n+│ Error: Invalid use of an ephemeral value\n+│\n+│   with aws_secretsmanager_secret_version.store_from_ephemeral_output,\n+│   on main.tf line 31, in resource \"aws_secretsmanager_secret_version\" \"store_from_ephemeral_output\":\n+│   31:   secret_string = module.secret_management.secrets\n+│\n+│ \"secret_string\" cannot accept an ephemeral value because it is not a write-only attribute which means that will be written to the state.\n+╵\n+```\n+\n+Any output that wants to use an ephemeral value, it needs to be marked as ephemeral too.\n+Otherwise, it needs to show an error:\n+```hcl\n+│ Error: Output not marked as ephemeral\n+│\n+│   on mod/main.tf line 33, in output \"password\":\n+│   33:   value = reference.to.ephemeral.value\n+│\n+│ In order to allow this output to store ephemeral values add `ephemeral = true` attribute to it.\n+```\n+> [!NOTE]\n+>\n+> It's needed to say that the last error will be raised only when a non-ephemeral output is referencing an ephemeral value.\n+> But it needs to be allowed for an ephemeral marked output to reference a non-ephemeral value.\n+\n+#### Locals\n+Local values are automatically marked as ephemeral if any of the value that is used to compute the local is already an ephemeral one.\n+\n+Eg:\n+```hcl\n+variable \"a\" {\n+  type = string\n+  default = \"a value\"\n+}\n+\n+variable \"b\" {\n+  type = string\n+  default = \"b value\"\n+  ephemeral = true\n+}\n+\n+locals {\n+  a_and_b = \"${var.a}_${var.b}\"\n+}\n+```\n+Because variable `b` is marked as `ephemeral`, then the local `a_and_b` is marked as `ephemeral` too.\n+\n+Locals marked as ephemeral are available during plan and apply phase and can be referenced only in specific contexts:\n+* ephemeral variables\n+* other ephemeral locals\n+* write-only attributes\n+* ephemeral resources\n+* `provider` blocks configuration\n+* `connection` and `provisioner` blocks\n+\n+#### Ephemeral resource\n+In contrast with the write-only arguments where only specifically tagged attributes are not stored in the state/plan file, `ephemeral` resources are not stored entirely.\n+The ephemeral blocks are behaving similar to `data`, where it reads the indicated resource and once it's done with it, is going to close it.\n+\n+Ephemeral resources can be referenced only in specific contexts:\n+* other ephemeral resources\n+* ephemeral variables\n+* ephemeral outputs\n+* locals\n+* to configure `provider` blocks\n+* in `provisioner` and `connection` blocks\n+* in write-only arguments\n+\n+For example, you can have an ephemeral resource that is retrieving the password from a secret manager, password that can be passed later into a write-only attribute of another normal `resource`.\n+To do so, the flow of an ephemeral resource should look similar to the following:\n+* Requests the information from the provider.\n+* Is passing it into the evaluation context that will be used to evaluate expressions that are referencing it.\n+  * Is not storing the value in plan or state file.\n+* When accessing the value, OpenTofu will have to check for the presence of the `RenewAt`:\n+  * If the timestamp is having a value and the current timestamp is at or over the timestamp indicated by `RenewAt`, call the provider `Renew` method.\n+* When a reference is found to an ephemeral resource, OpenTofu should double check that the attribute referencing it is allowed to do so.\n+  * See the contexts above where an ephemeral resource can be referenced.\n+* At the end, the ephemeral resource needs to be closed. OpenTofu should call `Close` on the provider for all opened ephemeral resources.\n+\n+Beside the attributes in a schema of an ephemeral resource, the block should support also the meta-arguments existing in OpenTofu:\n+* `depends_on`\n+* `count`\n+* `for_each`\n+* `provider`\n+* `lifecycle`\n+\n+The only `lifecycle` content that ephemerals should support are `precondition` and `postcondition`. In case OpenTofu will find other known attributes of the `lifecycle` block, it should show an error similar to the following:\n+```\n+│ Error: Invalid lifecycle configuration for ephemeral resource\n+│                                                           \n+│   on ../mod/main.tf line 44, in ephemeral \"aws_secretsmanager_secret_version\" \"secret_retrieval\":                     \n+│   44:     create_before_destroy = true                    \n+│                                                           \n+│ The lifecycle argument \"create_before_destroy\" cannot be used in ephemeral resources. This is meant \n+│ to be used strictly in \"resource\" blocks.\n+```\n+\n+The meta-arguments `provisioner` and `connection` should not be supported.\n+#### Providers\n+`provider` block is ephemeral by nature, meaning that the configuration of this is never stored into state/plan file.\n+\n+Therefore, this block should be configurable by using ephemeral values.\n+\n+#### `provisioner` block\n+As `provisioner` information is not stored into the plan/state file, this can reference ephemeral values like ephemeral variables, outputs, locals and values from ephemeral resources.\n+\n+Whenever doing so, the output of the provisioner execution should be suppressed:\n+```\n+(local-exec): (output suppressed due to ephemeral value in config)\n+```\n+#### `connection` block\n+When the `connection` block is configured, this should be allowed to use ephemeral values from variables, outputs, locals and values from ephemeral resources.\n+\n+### Example on how the new changes will work together\n+To better understand how all of this should work in OpenTofu, let's take a look at a comprehensive example.\n+#### Configuration\n+<details>\n+<summary>./mod/main.tf</summary>\n+\n+```hcl\n+terraform {\n+  required_providers {\n+    aws = {\n+      source  = \"hashicorp/aws\"\n+      version = \"6.0.0-beta1\"\n+    }\n+  }\n+}\n+\n+variable \"secret_map\" {\n+  type = map(string)\n+  default = {}\n+  ephemeral = true # (1)\n+}\n+\n+variable \"secret_version\" { # (2)\n+  type    = number\n+  default = 1\n+}\n+\n+variable \"secret_manager_arn\" {\n+  type    = string\n+  default = \"\"\n+}\n+\n+resource \"aws_secretsmanager_secret\" \"manager\" {\n+  count = var.secret_version > 1 ? 1 : 0\n+  name  = \"ephemeral-rfc-example\"\n+}\n+\n+resource \"aws_secretsmanager_secret_version\" \"secret_creation\" {\n+  count                    = var.secret_version > 1 ? 1 : 0\n+  secret_id                = aws_secretsmanager_secret.manager[0].arn\n+  secret_string_wo = jsonencode(var.secret_map) # (3)\n+  secret_string_wo_version = var.secret_version\n+}\n+\n+ephemeral \"aws_secretsmanager_secret_version\" \"secret_retrieval\" { # (4)\n+  count     = var.secret_version > 1 ? 1 : 0\n+  secret_id = aws_secretsmanager_secret.manager[0].arn\n+  depends_on = [\n+    aws_secretsmanager_secret_version.secret_creation\n+  ]\n+}\n+\n+ephemeral \"aws_secretsmanager_secret_version\" \"secret_retrieval_direct\" {\n+  count     = var.secret_version > 1 ? 0 : 1\n+  secret_id = var.secret_manager_arn\n+}\n+\n+output \"secrets\" {\n+  value = \"${var.secret_version > 1 ?\n+    jsondecode(ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0].secret_string) :\n+    jsondecode(ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0].secret_string)}\"\n+  ephemeral = true # (5)\n+}\n+\n+output \"secret_manager_arn\" {\n+  value = var.secret_version > 1 ? aws_secretsmanager_secret.manager[0].arn : null\n+}\n+```\n+This module can be used for two separate operations:\n+1. When `secret_version` is having a value greater than 1, it will add the given `secret` into a secret manager.\n+2. When `secret_version` is not given, it will use the `secret_manager_arn` to read the secret by using an ephemeral resource.\n+\n+Details:\n+- (1) Variables should be able to be marked as ephemeral. By doing so, those should be able to be used only in ephemeral contexts.\n+- (2) Version field that is going together with the actual write-only argument to be able to update the value of it. To upgrade the secret, the version field needs to be updated, otherwise OpenTofu should generate no diff for it.\n+- (3) `aws_secretsmanager_secret_version.secret_creation.secret_string_wo` is the write-only attribute that is receiving the `secret` variable which is ephemeral (even though a write-only argument can use also a non-ephemeral value).\n+- (4) Using ephemeral resource to retrieve the secret. Maybe looks a little bit weird, because right above we are having the resource of the same type that is looking like it should be able to be used to get the secret. In reality, because that `resource` is using the write-only attribute `secret_string_wo` to store the information, that field is going to be null when referenced.\n+- (5) Module output that is referencing an ephemeral value, it needs to be marked as ephemeral too. Otherwise, OpenTofu should generate an error.\n+  - This is similar to the behavior that is already present for `sensitive` values.\n+</details>\n+\n+<details>\n+<summary>./store/main.tf</summary>\n+\n+```hcl\n+terraform {\n+  required_providers {\n+    aws = {\n+      source  = \"hashicorp/aws\"\n+      version = \"6.0.0-beta1\"\n+    }\n+  }\n+}\n+provider \"aws\" {\n+  alias = \"secrets-read-write\"\n+}\n+\n+variable \"access_key\" {\n+  type      = string\n+  ephemeral = false # (1)\n+}\n+\n+variable \"secret_key\" {\n+  type      = string\n+  ephemeral = false\n+}\n+\n+locals {\n+  secrets = {\n+    \"access_key\" : var.access_key,\n+    \"secret_key\" : var.secret_key\n+  }\n+}\n+\n+module \"secret_management\" {\n+  providers = {\n+    aws : aws.secrets-read-write\n+  }\n+  source         = \"../mod\"\n+  secret_map     = local.secrets\n+  secret_version = 2\n+}\n+\n+output \"secret_manager_arn\" {\n+  value = module.secret_management.secret_manager_arn\n+}\n+```\n+This file is a configuration used to manage the secrets from the secret manager and just \n+outputs the ARN of the secret manager to be used later.\n+\n+Details:\n+- (1) The variable that is going to be used in an ephemeral variable, is not required to be ephemeral. The value can also be a hardcoded value without being ephemeral.\n+</details>\n+\n+<details>\n+<summary>./read/main.tf</summary>\n+\n+```hcl\n+terraform {\n+  required_providers {\n+    aws = {\n+      source  = \"hashicorp/aws\"\n+      version = \"6.0.0-beta1\"\n+    }\n+  }\n+}\n+provider \"aws\" {\n+  alias = \"read-secrets\"\n+}\n+\n+variable \"secret_manager_arn\" {\n+  type = string\n+}\n+\n+module \"secret_management\" { # (1)\n+  providers = {\n+    aws : aws.read-secrets\n+  }\n+  source             = \"../mod\"\n+  secret_manager_arn = var.secret_manager_arn\n+}\n+\n+provider \"aws\" {\n+  alias      = \"dev-access\"\n+  access_key = module.secret_management.secrets[\"access_key\"] # (2)\n+  secret_key = module.secret_management.secrets[\"secret_key\"]\n+}\n+\n+resource \"aws_ssm_parameter\" \"store_ephemeral_in_write_only\" { # (3)\n+  provider         = aws.dev-access\n+  name             = \"parameter_from_ephemeral_value\"\n+  type             = \"SecureString\"\n+  value_wo = jsonencode(module.secret_management.secrets) # (4)\n+  value_wo_version = 1\n+\n+  provisioner \"local-exec\" {\n+    when    = create\n+    command = \"echo non-ephemeral value: ${aws_ssm_parameter.store_ephemeral_in_write_only.arn}\"\n+  }\n+\n+  # provisioner \"local-exec\" { # (5)\n+  #   when    = create\n+  #   command = \"echo write-only value: ${aws_ssm_parameter.store_ephemeral_in_write_only.value_wo}\"\n+  # }\n+\n+  provisioner \"local-exec\" {\n+    when    = create\n+    command = \"echo ephemeral value from module: #${jsonencode(module.secret_management.secrets)}#\" # (6)\n+  }\n+}\n+```\n+This configuration is using the same module to retrieve the secret by using an ephemeral resource and \n+is using it to create a new resource, passing the ephemeral value into a write-only attribute.\n+\n+Details:\n+- (1) Calling the module that we defined previously just to retrieve the secret by using an ephemeral value.\n+- (2) Use the secret from the module to configure the `aws.dev-access` provider.\n+- (3) Here we used `aws_ssm_parameter` which can be configured with write-only arguments.\n+- (4) Referencing a module ephemeral output to ensure that the ephemeral information is passed correctly between two modules.\n+- (5) This `provisioner` block is commented out because interpolation of null values is not allowed in OpenTofu. Reminder: a write-only argument will always be returned as null from the provider even when the configuration is actually having a value.\n+- (6) A provisioner that is referencing an ephemeral value (module output) should have its output suppressed. Details in [Write-only arguments under Technical Approach](#write-only-arguments)\n+</details>\n+\n+#### CLI Output\n+\n+<details>\n+<summary>Applying `store` configuration</summary>\n+\n+```\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Configuration unknown, deferring...\n+# ^^^ (1)\n+ \n+OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with\n+the following symbols:\n+  + create\n+\n+OpenTofu will perform the following actions:\n+\n+  # module.secret_management.aws_secretsmanager_secret.manager[0] will be created\n+  + resource \"aws_secretsmanager_secret\" \"manager\" {\n+      + name                           = \"ephemeral-rfc-example\"\n+      # ...\n+    }\n+\n+  # module.secret_management.aws_secretsmanager_secret_version.secret_creation[0] will be created\n+  + resource \"aws_secretsmanager_secret_version\" \"secret_creation\" {\n+      + secret_string_wo         = (write-only attribute)\n+      + secret_string_wo_version = 2\n+      # ...\n+    }\n+# ^^^ (2)\n+Plan: 2 to add, 0 to change, 0 to destroy.\n+\n+Changes to Outputs:\n+  + secret_manager_arn = (known after apply)\n+\n+Do you want to perform these actions?\n+  OpenTofu will perform the actions described above.\n+  Only 'yes' will be accepted to approve.\n+\n+  Enter a value: yes\n+\n+module.secret_management.aws_secretsmanager_secret.manager[0]: Creating...\n+module.secret_management.aws_secretsmanager_secret.manager[0]: Creation complete after 0s [id=arn:aws:secretsmanager:AWS_REGION:ACC_ID:secret:ephemeral-rfc-example-WGZP9D]\n+module.secret_management.aws_secretsmanager_secret_version.secret_creation[0]: Creating...\n+module.secret_management.aws_secretsmanager_secret_version.secret_creation[0]: Creation complete after 0s [id=arn:aws:secretsmanager:AWS_REGION:ACC_ID:secret:ephemeral-rfc-example-WGZP9D]\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Opening... # <--- (3)\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Opening complete after 0s\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Closing... # <--- (4)\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Closing complete after 0s\n+\n+Apply complete! Resources: 2 added, 0 changed, 0 destroyed.\n+\n+```\n+\n+This is an output that would be visible when running `tofu apply` by using `store/main.tf`.\n+\n+Details:\n+- (1) If an ephemeral block is referencing any unknown value, the opening is deferred for later, when the value will be known.\n+- (2) As can be seen, the ephemeral resources are not shown in the list of changes. The only mention of those is in the actual action logs where we can see that it opens and closing those.\n+- (3) This should be visible in the action logs, while an ephemeral resource will be opened.\n+- (4) This should be visible in the action logs, while an ephemeral resource will be closed.\n+</details>\n+\n+<details>\n+<summary>Applying `read` configuration</summary>\n+\n+```\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Opening...\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Opening complete after 0s\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Closing...\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Closing complete after 0s\n+# ^^^ (1)\n+OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the\n+following symbols:\n+  + create\n+\n+OpenTofu will perform the following actions:\n+\n+  # aws_ssm_parameter.store_ephemeral_in_write_only will be created\n+  + resource \"aws_ssm_parameter\" \"store_ephemeral_in_write_only\" {\n+      + name             = \"parameter_from_ephemeral_value\"\n+      + type             = \"SecureString\"\n+      + value            = (sensitive value)\n+      + value_wo         = (write-only attribute) # <--- (2)\n+      + value_wo_version = 1\n+      # ...\n+    }\n+\n+Plan: 1 to add, 0 to change, 0 to destroy.\n+\n+Do you want to perform these actions?\n+  OpenTofu will perform the actions described above.\n+  Only 'yes' will be accepted to approve.\n+\n+  Enter a value: yes\n+\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Opening...\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Opening complete after 0s\n+aws_ssm_parameter.store_ephemeral_in_write_only: Creating...\n+aws_ssm_parameter.store_ephemeral_in_write_only: Provisioning with 'local-exec'...\n+aws_ssm_parameter.store_ephemeral_in_write_only (local-exec): Executing: [\"/bin/sh\" \"-c\" \"echo non-ephemeral value: arn:aws:ssm:AWS_REGION:ACC_ID:parameter/parameter_from_ephemeral_value\"]\n+aws_ssm_parameter.store_ephemeral_in_write_only (local-exec): non-ephemeral value: arn:aws:ssm:AWS_REGION:ACC_ID:parameter/parameter_from_ephemeral_value\n+aws_ssm_parameter.store_ephemeral_in_write_only: Provisioning with 'local-exec'...\n+aws_ssm_parameter.store_ephemeral_in_write_only (local-exec): (output suppressed due to ephemeral value in config) # <--- (3)\n+aws_ssm_parameter.store_ephemeral_in_write_only (local-exec): (output suppressed due to ephemeral value in config)\n+aws_ssm_parameter.store_ephemeral_in_write_only: Creation complete after 0s [id=parameter_from_ephemeral_value]\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Closing...\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Closing complete after 0s\n+```\n+\n+This is an output that would be visible when running `tofu apply` by using `read/main.tf`.\n+\n+Details:\n+- (1) Because the only resource that this configuration is going to create is referencing an ephemeral resource from the module, the ephemeral resource is accessed during plan phase too.\n+- (2) Write-only arguments are not going to be shown in the UI either.\n+- (3) This is how a provisioner output should look like when an ephemeral value is used in the expression.\n+\n+</details>\n+\n+## Technical Approach\n+> [!NOTE]\n+>\n+> Any rule ending in `If any found, an error will be raised.` is having an error defined in the [User Documentation](#user-documentation) section.\n+\n+In this section, as in the \"Proposed Solution\" section, we'll go over each concept, but this time with a more technical focus.\n+\n+### Write-only arguments\n+Most of the write-only arguments logic is already in the [provider-framework](https://github.com/hashicorp/terraform-plugin-framework):\n+* [Initial implementation](https://github.com/hashicorp/terraform-plugin-framework/pull/1044)\n+* [Sets comparison enhancement](https://github.com/hashicorp/terraform-plugin-framework/pull/1064)\n+  * This seems to be related to the reason why sets of any kind are not allowed to be marked as write-only\n+* [Dynamic attribute validation](https://github.com/hashicorp/terraform-plugin-framework/pull/1090)\n+* [Prevent write-only for sets](https://github.com/hashicorp/terraform-plugin-framework/pull/1095)\n+* [Nullifying write-only attributes moved to an earlier stage](https://github.com/hashicorp/terraform-plugin-framework/pull/1097)\n+\n+On the OpenTofu side the following needs to be tackled:\n+* Update [Attribute](https://github.com/opentofu/opentofu/blob/ff4c84055065fa2d83d318155b72aef6434d99e4/internal/configs/configschema/schema.go#L44) to add a field for the WriteOnly flag.\n+* Update the validation of the provider generated plan in such a way to allow nil values for the fields that are actually having a value defined in the configuration. This is necessary because the plugin framework is setting nil any values that are marked as write-only.\n+  * Test this in-depth for all the block types except sets of any kind (Investigate and understand why sets are not allowed by the plugin framework).\n+    * Add a new validation on the provider schema to check against, set nested attributes and set nested blocks with writeOnly=true. Tested this with a version of terraform-plugin-framework that allowed writeOnly on sets and there is an error returned. (set attributes are allowed based on my tests)\n+      In order to understand this better, maybe we should allow this for the moment and test OpenTofu with the [plugin-framework version](https://github.com/hashicorp/terraform-plugin-framework/commit/0724df105602e6b6676e201b7c0c5e1d187df990) that allows sets to be write-only=true.\n+\n+> [!NOTE]\n+>\n+> Write-only attributes should be presented in the OpenTofu's UI as `(write-only attribute)` instead of the actual value.\n+\n+### Variables\n+\n+For enabling ephemeral variables, these are the basic steps that need to be taken:\n+* Update config to support the `ephemeral` attribute.\n+* Mark the variables with a new mark and ensure that the marks are propagated correctly.\n+  * Recently, [2503](https://github.com/opentofu/opentofu/pull/2503) has been merged. This changed the way OpenTofu is handling marks. Before 2503, there was only one mark (sensitive), so there were places that treated a marked value as a sensitive one, but when a new mark (deprecated) has been introduced, we had to fix the way OpenTofu considers sensitive values.\n+* Based on the marks, ensure that the variable cannot be used in other contexts than the ephemeral ones (see the [User Documentation](#user-documentation) section for more details on where this is allowed). If any found, an error will be raised.\n+* Check the state of [#1998](https://github.com/opentofu/opentofu/pull/1998). If that is merged, in the changes where variables from plan are verified against the configuration ones, we also need to add a validation on the ephemerality of variables. If the variable is marked as ephemeral, then the plan value is allowed (expected) to be missing.\n+* Ensure that when the prompt is shown for an ephemeral variable, there is indication of that:\n+  ```hcl\n+  var.password (ephemeral)\n+     Enter a value:\n+  ```\n+* If a module is having an ephemeral variable declared, that variable can get values from any source, even another non-ephemeral variable.\n+* A variable not marked as ephemeral should not be able to reference an ephemeral value. A non-ephemeral variable will not become ephemeral when referencing an ephemeral value. If any found, an error will be raised.\n+\n+We should use boolean marks, as no additional information is required to be carried. When introducing the marks for these, extra care should be taken in *all* the places marks are handled and ensure that the existing implementation around marks is not affected.\n+\n+> [!NOTE]\n+>\n+> When adding the mark for ephemeral, ensure that there are unit tests to confirm that multiple mark types can work together:\n+> * When an ephemeral marked value is marked also with deprecated/sensitive, all marks are present on the value.\n+> * When an ephemeral marked value is unmarked for some operations, the other marks are still carried over.\n+\n+### Outputs\n+\n+For enabling ephemeral outputs, these are the basic steps that need to be taken:\n+* Update config to support the `ephemeral` attribute.\n+* Mark the outputs with a new mark and ensure that the marks are propagated correctly.\n+  * We should use boolean marks, as no additional information is required to be carried. When introducing the marks for these, extra care should be taken in *all* the places marks are handled and ensure that the existing implementation around marks is not affected.\n+* Based on the marks, ensure that the output cannot be used in other contexts than the ephemeral ones (see the [User Documentation](#user-documentation) section for more details on where this is allowed). If any found, an error will be raised.\n+\n+> [!INFO]\n+>\n+> For an example on how to properly introduce a new mark in the outputs, you can check the [PR](https://github.com/opentofu/opentofu/pull/2633) for the deprecated outputs.\n+\n+Strict rules:\n+* A root module cannot define ephemeral outputs. If any found, an error will be raised.\n+* Any output that wants to use an ephemeral value, it needs to be marked as ephemeral too. If any found, an error will be raised.\n+* Any output referencing an ephemeral value needs to be marked as ephemeral too. If any found, an error will be raised.\n+* Any output from a root module that is referencing a write-only attribute needs to be marked as sensitive. If any found, an error will be raised.\n+* Any output marked as ephemeral should be able to reference a non-ephemeral value.\n+\n+Considering the rules above, root modules cannot have any ephemeral outputs defined.\n+\n+### Locals\n+Any `local` declaration should be marked as ephemeral if in the expression that initialises it an ephemeral value is used:\n+```hcl\n+variable \"var1\" {\n+  type = string\n+}\n+\n+variable \"var2\" {\n+  type = string\n+}\n+\n+variable \"var3\" {\n+  type      = string\n+  ephemeral = true\n+}\n+\n+locals {\n+  eg1 = var.var1 == \"\" ? var.var2 : var.var1 // not ephemeral\n+  eg2 = var.var2 // not ephemeral\n+  eg3 = var.var3 == \"\" ? var.var2 : var.var1 // ephemeral because of var3 conditional\n+  eg4 = var.var1 == \"\" ? var.var2 : var.var3 // ephemeral because of var3 usage\n+  eg5 = \"${var.var3}-${var.var1}\" // ephemeral because of var3 usage\n+  eg6 = local.eg4 // ephemeral because of eg4 is ephemeral\n+}\n+```\n+\n+Once a local is marked as ephemeral, this can be used only in other ephemeral contexts. Check the `Proposed Solution` section for more details on the allowed contexts.\n+\n+### Ephemeral resources\n+Due to the fact ephemeral resources are not stored in the state/plan file, this block is not creating a diff in the OpenTofu's UI.\n+Instead, OpenTofu should notify the user of opening/renewing/closing an ephemeral resource with messages similar to the following:\n+```bash\n+ephemeral.playground_random.password: Opening...\n+ephemeral.playground_random.password: Opening succeeded after 0s\n+ephemeral.playground_random.password: Closing...\n+ephemeral.playground_random.password: Closing succeeded after 0s\n+```\n+\n+Methods that an ephemeral resource should/could have:\n+* Required:\n+  * Open - should be called on the provider to read the information of the indicated resource.\n+  * Metadata - returns the type name of the ephemeral resource.\n+  * Schema - should be called on the provider to get the schema defined for the ephemeral resource.\n+* Optional:\n+  * Renew - if the response from `Open` contains a valid `RenewAt`, OpenTofu should call this method in order to instruct the provider to renew any possible remote information related to the secret returned from the `Open` call.\n+  * Close - should be called on the provider to clean any possible remote information related to the secret returned in the response from `Open`.\n+  * ValidateConfig - validates the configuration provided for the ephemeral resource.\n+\n+Ephemeral resources lifecycle is similar with the data blocks:\n+* Both basic implementations require the same methods (`Metadata` and `Schema`) while datasource is defining `Read` compared with the ephemeral resource that is defining `Open`. When talking about the basic functionality of the ephemeral resources, the `Open` method should behave similarly with the `Read` on a datasource, where it asks the provider for the data associated with that particular ephemeral resource.",
        "comment_created_at": "2025-05-23T14:52:42+00:00",
        "comment_author": "Gogotchuri",
        "comment_body": "Correctness and Clarity @grammar\r\n```suggestion\r\n* Both basic implementations require the same methods (`Metadata` and `Schema`) while the datasource defines `Read` compared with the ephemeral resource defining `Open`. When talking about the basic functionality of the ephemeral resources, the `Open` method should behave similarly to the `Read` on a datasource, where it asks the provider for the data associated with that particular ephemeral resource.\r\n```",
        "pr_file_module": null
      },
      {
        "comment_id": "2106676425",
        "repo_full_name": "opentofu/opentofu",
        "pr_number": 2793,
        "pr_file": "rfc/20250317-ephemeral-resources.md",
        "discussion_id": "2104771111",
        "commented_code": "@@ -0,0 +1,859 @@\n+# Ephemeral resources, variables, outputs, locals and write-only arguments\n+\n+Issue: https://github.com/opentofu/opentofu/issues/1996\n+\n+Right now, OpenTofu information for resources and outputs are written to state and plan files as it is. This is presenting a security risk\n+as some information from the stored objects can contain sensitive bits that can become visible to whoever is having access to the state or plan files.\n+\n+To provide a better solution for the aforementioned situation, OpenTofu introduces the concept of \"ephemerality\" which is meant to make use of the already existing functionality in terraform-plugin-framework.\n+Any new feature under this new concept should provide ways to skip values from being written to the state and plan files.\n+\n+This new concept is going to offer another way to tackle the aforementioned issue, adding one more option in OpenTofu to choose for securing the plan and state files.\n+Here are the other existing options, providing different levels of safety:\n+* sensitive marked outputs and variables\n+  * The values marked this way ensures only that the information is sanitized from the user interface, but these are still stored in plaintext in the state and plan files.\n+* state encryption (recommended way)\n+  * This is meant to provide in transit and at rest encryption of the state and plan files, regardless of what providers/modules offer.\n+  * By using this you don't need to choose what to store and what not, but everything is safely stored.\n+  * This is also preventing state tempering and [privilege escalation](https://www.plerion.com/blog/hacking-terraform-state-for-privilege-escalation).\n+\n+## Proposed Solution\n+Two new concepts will be introduced:\n+* `ephemeral` resources\n+* `resource`'s `write-only` attributes\n+\n+Several existing features will have to be able to be updated with the new functionality:\n+* variables\n+* outputs\n+* locals\n+* providers\n+* provisioners\n+* `connection` block\n+\n+> [!NOTE]\n+>\n+> In order to provide a similar and familiar UX for the users, the proposal in this RFC is heavily inspired by the Terraform public documentation and available blog posts on the matter.\n+\n+In the attempt to provide to the reader an in-depth understanding of the ephemerality implications in OpenTofu,\n+this section will try to explain the functional approach of the new concept in each existing feature.\n+\n+### User Documentation\n+#### Write-only attributes\n+This is a new concept that allows any existing `resource` to define attributes in its schema that can be only written without the ability to retrieve the value afterwards.\n+\n+By not being readable, this also means that an attribute configured by a provider this way, should not be written to the state or plan file either.\n+Therefore, these attributes are suitable for configuring specific resources with sensitive data, like passwords, access keys, etc.\n+\n+A write-only attribute can accept an ephemeral or a non-ephemeral value, even though it's recommended to use ephemeral values for such attributes.\n+\n+Because these attributes are not written to the plan file, the update of a write-only attribute it's getting a little bit trickier.\n+Provider implementations do generally include also a \"version\" argument linked to the write-only one.\n+For example having a write-only argument called `secret`, providers should also include\n+a non-write-only argument called `secret_version`. Every time the user wants to update the value of `secret`, it needs to change the value of `secret_version` to trigger a change.\n+The provider implementation is responsible with handling this particular case: because the version attribute is stored also in the state, the provider needs to compare the value from the state with the one from the configuration and in case it differs, it will trigger the update of the `secret` attribute.\n+\n+At the time of writing this RFC, write-only attributes are supported by a low number of providers and resources.\n+Having the `aws_db_instance` as one of those, here is an example on how to use the write-only attributes:\n+```hcl\n+resource \"aws_db_instance\" \"example\" {\n+  // ...\n+  password_wo         = \"your-initial-password\"\n+  password_wo_version = 1\n+  // ...\n+}\n+```\n+By updating **only** the `password_wo`, on the `tofu apply`, the password should not be updated.\n+To do so, the `password_wo_version` needs to be incremented too:\n+```hcl\n+resource \"aws_db_instance\" \"example\" {\n+  // ...\n+  password_wo         = \"new-password\"\n+  password_wo_version = 2\n+  // ...\n+}\n+```\n+\n+As seen in this particular change of the [terraform-plugin-framework](https://github.com/hashicorp/terraform-plugin-framework/commit/ecd80f67daed0b92b243ae59bb1ee2077f8077c7), the write-only attribute cannot be configured for set attributes, set nested attributes and set nested blocks.\n+\n+Write-only attributes cannot generate a plan diff.\n+This is because the prior state does not contain a value that OpenTofu can use to compare the new value against and\n+also the value provider returns during planning of a write-only argument should always be null.\n+This means that there could be inconsistencies between plan and apply for the write-only arguments.\n+\n+#### Variables\n+Any `variable` block can be marked as ephemeral.\n+```hcl\n+variable \"ephemeral_var\" {\n+  type      = string\n+  ephemeral = true\n+}\n+```\n+OpenTofu should allow usage of these variables only in other ephemeral contexts:\n+* write-only arguments\n+* other ephemeral variables\n+* ephemeral outputs\n+* local values\n+* ephemeral resources\n+* provisioner blocks\n+* connection blocks\n+* provider configuration\n+\n+Usage in any other place should raise an error:\n+```hcl\n+│ Error: Invalid use of an ephemeral value\n+│\n+│   with playground_secret.store_secret,\n+│   on main.tf line 30, in resource \"playground_secret\" \"store_secret\":\n+│   30:   secret_name = var.password\n+│\n+│ \"secret_name\" cannot accept an ephemeral value because it is not a write-only attribute which means that will be written to the state.\n+╵\n+```\n+\n+For being able to use ephemeral variables, the module's authors need to mark those as so.\n+If OpenTofu finds an ephemeral value given to a non-ephemeral variable in a module call, an error will be shown:\n+```hcl\n+│ Error: Invalid usage of ephemeral value\n+│\n+│   on main.tf line 21, in module \"secret_management\":\n+│   21:   secret_map     = var.secrets\n+│\n+│ Variable `secret_map` is not marked as ephemeral. Therefore, it cannot reference an ephemeral value. In case this is actually wanted, you can add the following attribute to its declaration:\n+│   ephemeral = true\n+```\n+\n+\n+OpenTofu should not store ephemeral variable(s) in plan files.\n+If a plan is generated from a configuration that is having at least one ephemeral variable,\n+when the planfile will be applied, the value(s) for the ephemeral variable(s) needs to be provided again.\n+\n+#### Outputs\n+Most `output` blocks can be configured as ephemeral.\n+\n+To mark an output as ephemeral, use the following syntax:\n+```hcl\n+output \"test\" {\n+  // ...\n+  ephemeral = true\n+}\n+```\n+\n+The ephemeral outputs are available during plan and apply phase and can be accessed only in specific contexts:\n+* ephemeral variables\n+* other ephemeral outputs\n+* write-only attributes\n+* ephemeral resources\n+* `provisioner` block\n+* `connection` block\n+\n+An `output` block from a root module cannot be marked as ephemeral.\n+This limitation is natural since ephemeral outputs are meant to be skipped from the state file.\n+Therefore, there is no usage of such a defined output block in a root module.\n+When encountering an ephemeral output in a root module, an error similar to this one should be shown:\n+```hcl\n+│ Error: Unallowed ephemeral output\n+│\n+│   on main.tf line 36:\n+│   36: output \"write_only_out\" {\n+│\n+│ Root module is not allowed to have ephemeral outputs\n+```\n+\n+Ephemeral outputs are useful when a child module returns sensitive data,\n+allowing the caller to use the value of that output in other ephemeral contexts.\n+When using outputs in non-ephemeral contexts, OpenTofu should show an error similar to the following:\n+```hcl\n+│ Error: Invalid use of an ephemeral value\n+│\n+│   with aws_secretsmanager_secret_version.store_from_ephemeral_output,\n+│   on main.tf line 31, in resource \"aws_secretsmanager_secret_version\" \"store_from_ephemeral_output\":\n+│   31:   secret_string = module.secret_management.secrets\n+│\n+│ \"secret_string\" cannot accept an ephemeral value because it is not a write-only attribute which means that will be written to the state.\n+╵\n+```\n+\n+Any output that wants to use an ephemeral value, it needs to be marked as ephemeral too.\n+Otherwise, it needs to show an error:\n+```hcl\n+│ Error: Output not marked as ephemeral\n+│\n+│   on mod/main.tf line 33, in output \"password\":\n+│   33:   value = reference.to.ephemeral.value\n+│\n+│ In order to allow this output to store ephemeral values add `ephemeral = true` attribute to it.\n+```\n+> [!NOTE]\n+>\n+> It's needed to say that the last error will be raised only when a non-ephemeral output is referencing an ephemeral value.\n+> But it needs to be allowed for an ephemeral marked output to reference a non-ephemeral value.\n+\n+#### Locals\n+Local values are automatically marked as ephemeral if any of the value that is used to compute the local is already an ephemeral one.\n+\n+Eg:\n+```hcl\n+variable \"a\" {\n+  type = string\n+  default = \"a value\"\n+}\n+\n+variable \"b\" {\n+  type = string\n+  default = \"b value\"\n+  ephemeral = true\n+}\n+\n+locals {\n+  a_and_b = \"${var.a}_${var.b}\"\n+}\n+```\n+Because variable `b` is marked as `ephemeral`, then the local `a_and_b` is marked as `ephemeral` too.\n+\n+Locals marked as ephemeral are available during plan and apply phase and can be referenced only in specific contexts:\n+* ephemeral variables\n+* other ephemeral locals\n+* write-only attributes\n+* ephemeral resources\n+* `provider` blocks configuration\n+* `connection` and `provisioner` blocks\n+\n+#### Ephemeral resource\n+In contrast with the write-only arguments where only specifically tagged attributes are not stored in the state/plan file, `ephemeral` resources are not stored entirely.\n+The ephemeral blocks are behaving similar to `data`, where it reads the indicated resource and once it's done with it, is going to close it.\n+\n+Ephemeral resources can be referenced only in specific contexts:\n+* other ephemeral resources\n+* ephemeral variables\n+* ephemeral outputs\n+* locals\n+* to configure `provider` blocks\n+* in `provisioner` and `connection` blocks\n+* in write-only arguments\n+\n+For example, you can have an ephemeral resource that is retrieving the password from a secret manager, password that can be passed later into a write-only attribute of another normal `resource`.\n+To do so, the flow of an ephemeral resource should look similar to the following:\n+* Requests the information from the provider.\n+* Is passing it into the evaluation context that will be used to evaluate expressions that are referencing it.\n+  * Is not storing the value in plan or state file.\n+* When accessing the value, OpenTofu will have to check for the presence of the `RenewAt`:\n+  * If the timestamp is having a value and the current timestamp is at or over the timestamp indicated by `RenewAt`, call the provider `Renew` method.\n+* When a reference is found to an ephemeral resource, OpenTofu should double check that the attribute referencing it is allowed to do so.\n+  * See the contexts above where an ephemeral resource can be referenced.\n+* At the end, the ephemeral resource needs to be closed. OpenTofu should call `Close` on the provider for all opened ephemeral resources.\n+\n+Beside the attributes in a schema of an ephemeral resource, the block should support also the meta-arguments existing in OpenTofu:\n+* `depends_on`\n+* `count`\n+* `for_each`\n+* `provider`\n+* `lifecycle`\n+\n+The only `lifecycle` content that ephemerals should support are `precondition` and `postcondition`. In case OpenTofu will find other known attributes of the `lifecycle` block, it should show an error similar to the following:\n+```\n+│ Error: Invalid lifecycle configuration for ephemeral resource\n+│                                                           \n+│   on ../mod/main.tf line 44, in ephemeral \"aws_secretsmanager_secret_version\" \"secret_retrieval\":                     \n+│   44:     create_before_destroy = true                    \n+│                                                           \n+│ The lifecycle argument \"create_before_destroy\" cannot be used in ephemeral resources. This is meant \n+│ to be used strictly in \"resource\" blocks.\n+```\n+\n+The meta-arguments `provisioner` and `connection` should not be supported.\n+#### Providers\n+`provider` block is ephemeral by nature, meaning that the configuration of this is never stored into state/plan file.\n+\n+Therefore, this block should be configurable by using ephemeral values.\n+\n+#### `provisioner` block\n+As `provisioner` information is not stored into the plan/state file, this can reference ephemeral values like ephemeral variables, outputs, locals and values from ephemeral resources.\n+\n+Whenever doing so, the output of the provisioner execution should be suppressed:\n+```\n+(local-exec): (output suppressed due to ephemeral value in config)\n+```\n+#### `connection` block\n+When the `connection` block is configured, this should be allowed to use ephemeral values from variables, outputs, locals and values from ephemeral resources.\n+\n+### Example on how the new changes will work together\n+To better understand how all of this should work in OpenTofu, let's take a look at a comprehensive example.\n+#### Configuration\n+<details>\n+<summary>./mod/main.tf</summary>\n+\n+```hcl\n+terraform {\n+  required_providers {\n+    aws = {\n+      source  = \"hashicorp/aws\"\n+      version = \"6.0.0-beta1\"\n+    }\n+  }\n+}\n+\n+variable \"secret_map\" {\n+  type = map(string)\n+  default = {}\n+  ephemeral = true # (1)\n+}\n+\n+variable \"secret_version\" { # (2)\n+  type    = number\n+  default = 1\n+}\n+\n+variable \"secret_manager_arn\" {\n+  type    = string\n+  default = \"\"\n+}\n+\n+resource \"aws_secretsmanager_secret\" \"manager\" {\n+  count = var.secret_version > 1 ? 1 : 0\n+  name  = \"ephemeral-rfc-example\"\n+}\n+\n+resource \"aws_secretsmanager_secret_version\" \"secret_creation\" {\n+  count                    = var.secret_version > 1 ? 1 : 0\n+  secret_id                = aws_secretsmanager_secret.manager[0].arn\n+  secret_string_wo = jsonencode(var.secret_map) # (3)\n+  secret_string_wo_version = var.secret_version\n+}\n+\n+ephemeral \"aws_secretsmanager_secret_version\" \"secret_retrieval\" { # (4)\n+  count     = var.secret_version > 1 ? 1 : 0\n+  secret_id = aws_secretsmanager_secret.manager[0].arn\n+  depends_on = [\n+    aws_secretsmanager_secret_version.secret_creation\n+  ]\n+}\n+\n+ephemeral \"aws_secretsmanager_secret_version\" \"secret_retrieval_direct\" {\n+  count     = var.secret_version > 1 ? 0 : 1\n+  secret_id = var.secret_manager_arn\n+}\n+\n+output \"secrets\" {\n+  value = \"${var.secret_version > 1 ?\n+    jsondecode(ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0].secret_string) :\n+    jsondecode(ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0].secret_string)}\"\n+  ephemeral = true # (5)\n+}\n+\n+output \"secret_manager_arn\" {\n+  value = var.secret_version > 1 ? aws_secretsmanager_secret.manager[0].arn : null\n+}\n+```\n+This module can be used for two separate operations:\n+1. When `secret_version` is having a value greater than 1, it will add the given `secret` into a secret manager.\n+2. When `secret_version` is not given, it will use the `secret_manager_arn` to read the secret by using an ephemeral resource.\n+\n+Details:\n+- (1) Variables should be able to be marked as ephemeral. By doing so, those should be able to be used only in ephemeral contexts.\n+- (2) Version field that is going together with the actual write-only argument to be able to update the value of it. To upgrade the secret, the version field needs to be updated, otherwise OpenTofu should generate no diff for it.\n+- (3) `aws_secretsmanager_secret_version.secret_creation.secret_string_wo` is the write-only attribute that is receiving the `secret` variable which is ephemeral (even though a write-only argument can use also a non-ephemeral value).\n+- (4) Using ephemeral resource to retrieve the secret. Maybe looks a little bit weird, because right above we are having the resource of the same type that is looking like it should be able to be used to get the secret. In reality, because that `resource` is using the write-only attribute `secret_string_wo` to store the information, that field is going to be null when referenced.\n+- (5) Module output that is referencing an ephemeral value, it needs to be marked as ephemeral too. Otherwise, OpenTofu should generate an error.\n+  - This is similar to the behavior that is already present for `sensitive` values.\n+</details>\n+\n+<details>\n+<summary>./store/main.tf</summary>\n+\n+```hcl\n+terraform {\n+  required_providers {\n+    aws = {\n+      source  = \"hashicorp/aws\"\n+      version = \"6.0.0-beta1\"\n+    }\n+  }\n+}\n+provider \"aws\" {\n+  alias = \"secrets-read-write\"\n+}\n+\n+variable \"access_key\" {\n+  type      = string\n+  ephemeral = false # (1)\n+}\n+\n+variable \"secret_key\" {\n+  type      = string\n+  ephemeral = false\n+}\n+\n+locals {\n+  secrets = {\n+    \"access_key\" : var.access_key,\n+    \"secret_key\" : var.secret_key\n+  }\n+}\n+\n+module \"secret_management\" {\n+  providers = {\n+    aws : aws.secrets-read-write\n+  }\n+  source         = \"../mod\"\n+  secret_map     = local.secrets\n+  secret_version = 2\n+}\n+\n+output \"secret_manager_arn\" {\n+  value = module.secret_management.secret_manager_arn\n+}\n+```\n+This file is a configuration used to manage the secrets from the secret manager and just \n+outputs the ARN of the secret manager to be used later.\n+\n+Details:\n+- (1) The variable that is going to be used in an ephemeral variable, is not required to be ephemeral. The value can also be a hardcoded value without being ephemeral.\n+</details>\n+\n+<details>\n+<summary>./read/main.tf</summary>\n+\n+```hcl\n+terraform {\n+  required_providers {\n+    aws = {\n+      source  = \"hashicorp/aws\"\n+      version = \"6.0.0-beta1\"\n+    }\n+  }\n+}\n+provider \"aws\" {\n+  alias = \"read-secrets\"\n+}\n+\n+variable \"secret_manager_arn\" {\n+  type = string\n+}\n+\n+module \"secret_management\" { # (1)\n+  providers = {\n+    aws : aws.read-secrets\n+  }\n+  source             = \"../mod\"\n+  secret_manager_arn = var.secret_manager_arn\n+}\n+\n+provider \"aws\" {\n+  alias      = \"dev-access\"\n+  access_key = module.secret_management.secrets[\"access_key\"] # (2)\n+  secret_key = module.secret_management.secrets[\"secret_key\"]\n+}\n+\n+resource \"aws_ssm_parameter\" \"store_ephemeral_in_write_only\" { # (3)\n+  provider         = aws.dev-access\n+  name             = \"parameter_from_ephemeral_value\"\n+  type             = \"SecureString\"\n+  value_wo = jsonencode(module.secret_management.secrets) # (4)\n+  value_wo_version = 1\n+\n+  provisioner \"local-exec\" {\n+    when    = create\n+    command = \"echo non-ephemeral value: ${aws_ssm_parameter.store_ephemeral_in_write_only.arn}\"\n+  }\n+\n+  # provisioner \"local-exec\" { # (5)\n+  #   when    = create\n+  #   command = \"echo write-only value: ${aws_ssm_parameter.store_ephemeral_in_write_only.value_wo}\"\n+  # }\n+\n+  provisioner \"local-exec\" {\n+    when    = create\n+    command = \"echo ephemeral value from module: #${jsonencode(module.secret_management.secrets)}#\" # (6)\n+  }\n+}\n+```\n+This configuration is using the same module to retrieve the secret by using an ephemeral resource and \n+is using it to create a new resource, passing the ephemeral value into a write-only attribute.\n+\n+Details:\n+- (1) Calling the module that we defined previously just to retrieve the secret by using an ephemeral value.\n+- (2) Use the secret from the module to configure the `aws.dev-access` provider.\n+- (3) Here we used `aws_ssm_parameter` which can be configured with write-only arguments.\n+- (4) Referencing a module ephemeral output to ensure that the ephemeral information is passed correctly between two modules.\n+- (5) This `provisioner` block is commented out because interpolation of null values is not allowed in OpenTofu. Reminder: a write-only argument will always be returned as null from the provider even when the configuration is actually having a value.\n+- (6) A provisioner that is referencing an ephemeral value (module output) should have its output suppressed. Details in [Write-only arguments under Technical Approach](#write-only-arguments)\n+</details>\n+\n+#### CLI Output\n+\n+<details>\n+<summary>Applying `store` configuration</summary>\n+\n+```\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Configuration unknown, deferring...\n+# ^^^ (1)\n+ \n+OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with\n+the following symbols:\n+  + create\n+\n+OpenTofu will perform the following actions:\n+\n+  # module.secret_management.aws_secretsmanager_secret.manager[0] will be created\n+  + resource \"aws_secretsmanager_secret\" \"manager\" {\n+      + name                           = \"ephemeral-rfc-example\"\n+      # ...\n+    }\n+\n+  # module.secret_management.aws_secretsmanager_secret_version.secret_creation[0] will be created\n+  + resource \"aws_secretsmanager_secret_version\" \"secret_creation\" {\n+      + secret_string_wo         = (write-only attribute)\n+      + secret_string_wo_version = 2\n+      # ...\n+    }\n+# ^^^ (2)\n+Plan: 2 to add, 0 to change, 0 to destroy.\n+\n+Changes to Outputs:\n+  + secret_manager_arn = (known after apply)\n+\n+Do you want to perform these actions?\n+  OpenTofu will perform the actions described above.\n+  Only 'yes' will be accepted to approve.\n+\n+  Enter a value: yes\n+\n+module.secret_management.aws_secretsmanager_secret.manager[0]: Creating...\n+module.secret_management.aws_secretsmanager_secret.manager[0]: Creation complete after 0s [id=arn:aws:secretsmanager:AWS_REGION:ACC_ID:secret:ephemeral-rfc-example-WGZP9D]\n+module.secret_management.aws_secretsmanager_secret_version.secret_creation[0]: Creating...\n+module.secret_management.aws_secretsmanager_secret_version.secret_creation[0]: Creation complete after 0s [id=arn:aws:secretsmanager:AWS_REGION:ACC_ID:secret:ephemeral-rfc-example-WGZP9D]\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Opening... # <--- (3)\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Opening complete after 0s\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Closing... # <--- (4)\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval[0]: Closing complete after 0s\n+\n+Apply complete! Resources: 2 added, 0 changed, 0 destroyed.\n+\n+```\n+\n+This is an output that would be visible when running `tofu apply` by using `store/main.tf`.\n+\n+Details:\n+- (1) If an ephemeral block is referencing any unknown value, the opening is deferred for later, when the value will be known.\n+- (2) As can be seen, the ephemeral resources are not shown in the list of changes. The only mention of those is in the actual action logs where we can see that it opens and closing those.\n+- (3) This should be visible in the action logs, while an ephemeral resource will be opened.\n+- (4) This should be visible in the action logs, while an ephemeral resource will be closed.\n+</details>\n+\n+<details>\n+<summary>Applying `read` configuration</summary>\n+\n+```\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Opening...\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Opening complete after 0s\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Closing...\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Closing complete after 0s\n+# ^^^ (1)\n+OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the\n+following symbols:\n+  + create\n+\n+OpenTofu will perform the following actions:\n+\n+  # aws_ssm_parameter.store_ephemeral_in_write_only will be created\n+  + resource \"aws_ssm_parameter\" \"store_ephemeral_in_write_only\" {\n+      + name             = \"parameter_from_ephemeral_value\"\n+      + type             = \"SecureString\"\n+      + value            = (sensitive value)\n+      + value_wo         = (write-only attribute) # <--- (2)\n+      + value_wo_version = 1\n+      # ...\n+    }\n+\n+Plan: 1 to add, 0 to change, 0 to destroy.\n+\n+Do you want to perform these actions?\n+  OpenTofu will perform the actions described above.\n+  Only 'yes' will be accepted to approve.\n+\n+  Enter a value: yes\n+\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Opening...\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Opening complete after 0s\n+aws_ssm_parameter.store_ephemeral_in_write_only: Creating...\n+aws_ssm_parameter.store_ephemeral_in_write_only: Provisioning with 'local-exec'...\n+aws_ssm_parameter.store_ephemeral_in_write_only (local-exec): Executing: [\"/bin/sh\" \"-c\" \"echo non-ephemeral value: arn:aws:ssm:AWS_REGION:ACC_ID:parameter/parameter_from_ephemeral_value\"]\n+aws_ssm_parameter.store_ephemeral_in_write_only (local-exec): non-ephemeral value: arn:aws:ssm:AWS_REGION:ACC_ID:parameter/parameter_from_ephemeral_value\n+aws_ssm_parameter.store_ephemeral_in_write_only: Provisioning with 'local-exec'...\n+aws_ssm_parameter.store_ephemeral_in_write_only (local-exec): (output suppressed due to ephemeral value in config) # <--- (3)\n+aws_ssm_parameter.store_ephemeral_in_write_only (local-exec): (output suppressed due to ephemeral value in config)\n+aws_ssm_parameter.store_ephemeral_in_write_only: Creation complete after 0s [id=parameter_from_ephemeral_value]\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Closing...\n+module.secret_management.ephemeral.aws_secretsmanager_secret_version.secret_retrieval_direct[0]: Closing complete after 0s\n+```\n+\n+This is an output that would be visible when running `tofu apply` by using `read/main.tf`.\n+\n+Details:\n+- (1) Because the only resource that this configuration is going to create is referencing an ephemeral resource from the module, the ephemeral resource is accessed during plan phase too.\n+- (2) Write-only arguments are not going to be shown in the UI either.\n+- (3) This is how a provisioner output should look like when an ephemeral value is used in the expression.\n+\n+</details>\n+\n+## Technical Approach\n+> [!NOTE]\n+>\n+> Any rule ending in `If any found, an error will be raised.` is having an error defined in the [User Documentation](#user-documentation) section.\n+\n+In this section, as in the \"Proposed Solution\" section, we'll go over each concept, but this time with a more technical focus.\n+\n+### Write-only arguments\n+Most of the write-only arguments logic is already in the [provider-framework](https://github.com/hashicorp/terraform-plugin-framework):\n+* [Initial implementation](https://github.com/hashicorp/terraform-plugin-framework/pull/1044)\n+* [Sets comparison enhancement](https://github.com/hashicorp/terraform-plugin-framework/pull/1064)\n+  * This seems to be related to the reason why sets of any kind are not allowed to be marked as write-only\n+* [Dynamic attribute validation](https://github.com/hashicorp/terraform-plugin-framework/pull/1090)\n+* [Prevent write-only for sets](https://github.com/hashicorp/terraform-plugin-framework/pull/1095)\n+* [Nullifying write-only attributes moved to an earlier stage](https://github.com/hashicorp/terraform-plugin-framework/pull/1097)\n+\n+On the OpenTofu side the following needs to be tackled:\n+* Update [Attribute](https://github.com/opentofu/opentofu/blob/ff4c84055065fa2d83d318155b72aef6434d99e4/internal/configs/configschema/schema.go#L44) to add a field for the WriteOnly flag.\n+* Update the validation of the provider generated plan in such a way to allow nil values for the fields that are actually having a value defined in the configuration. This is necessary because the plugin framework is setting nil any values that are marked as write-only.\n+  * Test this in-depth for all the block types except sets of any kind (Investigate and understand why sets are not allowed by the plugin framework).\n+    * Add a new validation on the provider schema to check against, set nested attributes and set nested blocks with writeOnly=true. Tested this with a version of terraform-plugin-framework that allowed writeOnly on sets and there is an error returned. (set attributes are allowed based on my tests)\n+      In order to understand this better, maybe we should allow this for the moment and test OpenTofu with the [plugin-framework version](https://github.com/hashicorp/terraform-plugin-framework/commit/0724df105602e6b6676e201b7c0c5e1d187df990) that allows sets to be write-only=true.\n+\n+> [!NOTE]\n+>\n+> Write-only attributes should be presented in the OpenTofu's UI as `(write-only attribute)` instead of the actual value.\n+\n+### Variables\n+\n+For enabling ephemeral variables, these are the basic steps that need to be taken:\n+* Update config to support the `ephemeral` attribute.\n+* Mark the variables with a new mark and ensure that the marks are propagated correctly.\n+  * Recently, [2503](https://github.com/opentofu/opentofu/pull/2503) has been merged. This changed the way OpenTofu is handling marks. Before 2503, there was only one mark (sensitive), so there were places that treated a marked value as a sensitive one, but when a new mark (deprecated) has been introduced, we had to fix the way OpenTofu considers sensitive values.\n+* Based on the marks, ensure that the variable cannot be used in other contexts than the ephemeral ones (see the [User Documentation](#user-documentation) section for more details on where this is allowed). If any found, an error will be raised.\n+* Check the state of [#1998](https://github.com/opentofu/opentofu/pull/1998). If that is merged, in the changes where variables from plan are verified against the configuration ones, we also need to add a validation on the ephemerality of variables. If the variable is marked as ephemeral, then the plan value is allowed (expected) to be missing.\n+* Ensure that when the prompt is shown for an ephemeral variable, there is indication of that:\n+  ```hcl\n+  var.password (ephemeral)\n+     Enter a value:\n+  ```\n+* If a module is having an ephemeral variable declared, that variable can get values from any source, even another non-ephemeral variable.\n+* A variable not marked as ephemeral should not be able to reference an ephemeral value. A non-ephemeral variable will not become ephemeral when referencing an ephemeral value. If any found, an error will be raised.\n+\n+We should use boolean marks, as no additional information is required to be carried. When introducing the marks for these, extra care should be taken in *all* the places marks are handled and ensure that the existing implementation around marks is not affected.\n+\n+> [!NOTE]\n+>\n+> When adding the mark for ephemeral, ensure that there are unit tests to confirm that multiple mark types can work together:\n+> * When an ephemeral marked value is marked also with deprecated/sensitive, all marks are present on the value.\n+> * When an ephemeral marked value is unmarked for some operations, the other marks are still carried over.\n+\n+### Outputs\n+\n+For enabling ephemeral outputs, these are the basic steps that need to be taken:\n+* Update config to support the `ephemeral` attribute.\n+* Mark the outputs with a new mark and ensure that the marks are propagated correctly.\n+  * We should use boolean marks, as no additional information is required to be carried. When introducing the marks for these, extra care should be taken in *all* the places marks are handled and ensure that the existing implementation around marks is not affected.\n+* Based on the marks, ensure that the output cannot be used in other contexts than the ephemeral ones (see the [User Documentation](#user-documentation) section for more details on where this is allowed). If any found, an error will be raised.\n+\n+> [!INFO]\n+>\n+> For an example on how to properly introduce a new mark in the outputs, you can check the [PR](https://github.com/opentofu/opentofu/pull/2633) for the deprecated outputs.\n+\n+Strict rules:\n+* A root module cannot define ephemeral outputs. If any found, an error will be raised.\n+* Any output that wants to use an ephemeral value, it needs to be marked as ephemeral too. If any found, an error will be raised.\n+* Any output referencing an ephemeral value needs to be marked as ephemeral too. If any found, an error will be raised.\n+* Any output from a root module that is referencing a write-only attribute needs to be marked as sensitive. If any found, an error will be raised.\n+* Any output marked as ephemeral should be able to reference a non-ephemeral value.\n+\n+Considering the rules above, root modules cannot have any ephemeral outputs defined.\n+\n+### Locals\n+Any `local` declaration should be marked as ephemeral if in the expression that initialises it an ephemeral value is used:\n+```hcl\n+variable \"var1\" {\n+  type = string\n+}\n+\n+variable \"var2\" {\n+  type = string\n+}\n+\n+variable \"var3\" {\n+  type      = string\n+  ephemeral = true\n+}\n+\n+locals {\n+  eg1 = var.var1 == \"\" ? var.var2 : var.var1 // not ephemeral\n+  eg2 = var.var2 // not ephemeral\n+  eg3 = var.var3 == \"\" ? var.var2 : var.var1 // ephemeral because of var3 conditional\n+  eg4 = var.var1 == \"\" ? var.var2 : var.var3 // ephemeral because of var3 usage\n+  eg5 = \"${var.var3}-${var.var1}\" // ephemeral because of var3 usage\n+  eg6 = local.eg4 // ephemeral because of eg4 is ephemeral\n+}\n+```\n+\n+Once a local is marked as ephemeral, this can be used only in other ephemeral contexts. Check the `Proposed Solution` section for more details on the allowed contexts.\n+\n+### Ephemeral resources\n+Due to the fact ephemeral resources are not stored in the state/plan file, this block is not creating a diff in the OpenTofu's UI.\n+Instead, OpenTofu should notify the user of opening/renewing/closing an ephemeral resource with messages similar to the following:\n+```bash\n+ephemeral.playground_random.password: Opening...\n+ephemeral.playground_random.password: Opening succeeded after 0s\n+ephemeral.playground_random.password: Closing...\n+ephemeral.playground_random.password: Closing succeeded after 0s\n+```\n+\n+Methods that an ephemeral resource should/could have:\n+* Required:\n+  * Open - should be called on the provider to read the information of the indicated resource.\n+  * Metadata - returns the type name of the ephemeral resource.\n+  * Schema - should be called on the provider to get the schema defined for the ephemeral resource.\n+* Optional:\n+  * Renew - if the response from `Open` contains a valid `RenewAt`, OpenTofu should call this method in order to instruct the provider to renew any possible remote information related to the secret returned from the `Open` call.\n+  * Close - should be called on the provider to clean any possible remote information related to the secret returned in the response from `Open`.\n+  * ValidateConfig - validates the configuration provided for the ephemeral resource.\n+\n+Ephemeral resources lifecycle is similar with the data blocks:\n+* Both basic implementations require the same methods (`Metadata` and `Schema`) while datasource is defining `Read` compared with the ephemeral resource that is defining `Open`. When talking about the basic functionality of the ephemeral resources, the `Open` method should behave similarly with the `Read` on a datasource, where it asks the provider for the data associated with that particular ephemeral resource.",
        "comment_created_at": "2025-05-26T06:52:41+00:00",
        "comment_author": "yottta",
        "comment_body": "Wanted to add the suggestions individually but the signoff of the commit is not working correctly from the GH UI, so I added all your suggestions in one commit: 4ee1ec72ed946b32d50637bb893c4c754d1b6e4e",
        "pr_file_module": null
      }
    ]
  },
  {
    "discussion_id": "1641879716",
    "pr_number": 1717,
    "pr_file": "rfc/20240611-ExcludeFlag.md",
    "created_at": "2024-06-16T14:15:35+00:00",
    "commented_code": "+# Add Exclude Flag for Targeted Plan/Apply\n+\n+Issue: https://github.com/opentofu/opentofu/issues/426\n+\n+This RFC details a new flag, `-exclude`, which would do the inverse of `-target` - that is, plan/apply all resources except those specified by the exclude flag and their descendants.\n+\n+Only for use in exceptional circumstances as is the case for `-target`, this makes it a lot easier to plan/apply all changes to an environment except ones with known issues eg where there is a problem with the infrastructure or the committed config for one module/resource, but you still want to apply everything else.\n+\n+https://github.com/hashicorp/terraform/issues/2253 is one of the most requested features in the Terraform repo\n+\n+\n+## Proposed Solution\n+\n+Add a new flag, `-exclude`, to plan and apply. This should allow a plan to be created, or apply to be run, for all resources except those that are \"excluded\" and their children.\n+\n+### User Documentation\n+\n+- Usage example:\n+`opentf plan -exclude module.something_broken` / `opentf apply -exclude module.something_broken` should be added to --help output for plan/apply.\n+- Currently, it looks like `-target` is not mentioned in the docs/ directory of the repo.\n+- `-target` is documented in website/docs/cli/commands/plan.mdx, so we should also document `-exclude` there\n+- `-target` is *not* documented in website/docs/cli/commands/apply.mdx, but probably should be. It would be nice to add documentation for both `-target` and `-exclude` there\n+\n+### Technical Approach\n+\n+Technical summary, easy to understand by someone unfamiliar with the codebase.\n+\n+- `-exclude` flag added to extendedFlagSet when an operation is provided (same as `-target`)\n+- Passed through to `OperationRequest`\n+- `TargetsTransformer.Transform` should remove vertices that are in (or children of items in) `t.Excludes` if `t.Excludes` are provided (just like it currently removes vertices that _aren't_ in `t.Targets`).",
    "repo_full_name": "opentofu/opentofu",
    "discussion_comments": [
      {
        "comment_id": "1641879716",
        "repo_full_name": "opentofu/opentofu",
        "pr_number": 1717,
        "pr_file": "rfc/20240611-ExcludeFlag.md",
        "discussion_id": "1641879716",
        "commented_code": "@@ -0,0 +1,59 @@\n+# Add Exclude Flag for Targeted Plan/Apply\n+\n+Issue: https://github.com/opentofu/opentofu/issues/426\n+\n+This RFC details a new flag, `-exclude`, which would do the inverse of `-target` - that is, plan/apply all resources except those specified by the exclude flag and their descendants.\n+\n+Only for use in exceptional circumstances as is the case for `-target`, this makes it a lot easier to plan/apply all changes to an environment except ones with known issues eg where there is a problem with the infrastructure or the committed config for one module/resource, but you still want to apply everything else.\n+\n+https://github.com/hashicorp/terraform/issues/2253 is one of the most requested features in the Terraform repo\n+\n+\n+## Proposed Solution\n+\n+Add a new flag, `-exclude`, to plan and apply. This should allow a plan to be created, or apply to be run, for all resources except those that are \"excluded\" and their children.\n+\n+### User Documentation\n+\n+- Usage example:\n+`opentf plan -exclude module.something_broken` / `opentf apply -exclude module.something_broken` should be added to --help output for plan/apply.\n+- Currently, it looks like `-target` is not mentioned in the docs/ directory of the repo.\n+- `-target` is documented in website/docs/cli/commands/plan.mdx, so we should also document `-exclude` there\n+- `-target` is *not* documented in website/docs/cli/commands/apply.mdx, but probably should be. It would be nice to add documentation for both `-target` and `-exclude` there\n+\n+### Technical Approach\n+\n+Technical summary, easy to understand by someone unfamiliar with the codebase.\n+\n+- `-exclude` flag added to extendedFlagSet when an operation is provided (same as `-target`)\n+- Passed through to `OperationRequest`\n+- `TargetsTransformer.Transform` should remove vertices that are in (or children of items in) `t.Excludes` if `t.Excludes` are provided (just like it currently removes vertices that _aren't_ in `t.Targets`).",
        "comment_created_at": "2024-06-16T14:15:35+00:00",
        "comment_author": "RLRabinowitz",
        "comment_body": "```suggestion\r\n- `TargetsTransformer.Transform` should remove vertices that are in `t.Excludes`, or descendants of items in `t.Excludes`, if `t.Excludes` are provided (just like it currently removes vertices that _aren't_ in `t.Targets`).\r\n```",
        "pr_file_module": null
      }
    ]
  }
]